
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |      10 |          1 |          10 |
## Affected resources by action

|  Action  | Resources                                               |
|:--------:|:--------------------------------------------------------|
|    🟢     | `aws_db_instance.keycloak`                              |
|    🟢     | `aws_db_subnet_group.keycloak`                          |
|    🟢     | `aws_secretsmanager_secret.keycloak_service`            |
|    🟢     | `aws_secretsmanager_secret_version.keycloak_service`    |
|    🟢     | `aws_security_group.keycloak`                           |
|    🟢     | `aws_vpc_security_group_egress_rule.keycloak_outgoing`  |
|    🟢     | `aws_vpc_security_group_ingress_rule.keycloak-icmp`     |
|    🟢     | `aws_vpc_security_group_ingress_rule.keycloak-mysql`    |
|    🟢     | `random_password.keycloak_service`                      |
|    🟡     | `module.keycloak.aws_ecs_service.ecs`                   |
|    🔴     | `aws_db_instance.keycloack`                             |
|    🔴     | `aws_db_subnet_group.keycloack`                         |
|    🔴     | `aws_secretsmanager_secret.keycloack_service`           |
|    🔴     | `aws_secretsmanager_secret_version.keycloack_service`   |
|    🔴     | `aws_security_group.keycloack`                          |
|    🔴     | `aws_vpc_security_group_egress_rule.keycloack_outgoing` |
|    🔴     | `aws_vpc_security_group_ingress_rule.keycloack-icmp`    |
|    🔴     | `aws_vpc_security_group_ingress_rule.keycloack-mysql`   |
|    🔴     | `random_password.keycloack_service`                     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.keycloack will be destroyed
  # (because aws_db_instance.keycloack is not in configuration)
  - resource "aws_db_instance" "keycloack" {
      - address                               = "keycloack-20240303165626288600000003.c2uzeb8enbyb.us-west-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 10 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-west-1:493370826424:db:keycloack-20240303165626288600000003" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-west-1c" -> null
      - backup_retention_period               = 7 -> null
      - backup_target                         = "region" -> null
      - backup_window                         = "12:45-13:15" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - db_name                               = "keycloack" -> null
      - db_subnet_group_name                  = "keycloack20240303165624397300000001" -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "keycloack-20240303165626288600000003.c2uzeb8enbyb.us-west-1.rds.amazonaws.com:3306" -> null
      - engine                                = "mysql" -> null
      - engine_version                        = "8.0" -> null
      - engine_version_actual                 = "8.0.35" -> null
      - hosted_zone_id                        = "Z10WI91S59XXQN" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "db-ZS7IUWGOPXBB6P7M63J3LHQQ6E" -> null
      - identifier                            = "keycloack-20240303165626288600000003" -> null
      - identifier_prefix                     = "keycloack-" -> null
      - instance_class                        = "db.t3.micro" -> null
      - iops                                  = 0 -> null
      - latest_restorable_time                = "2024-03-03T17:35:00Z" -> null
      - license_model                         = "general-public-license" -> null
      - listener_endpoint                     = [] -> null
      - maintenance_window                    = "tue:12:07-tue:12:37" -> null
      - manage_master_user_password           = true -> null
      - master_user_secret                    = [
          - {
              - kms_key_id    = "arn:aws:kms:us-west-1:493370826424:key/4f32be31-ea72-4046-bafa-ea0a61a58cee"
              - secret_arn    = "arn:aws:secretsmanager:us-west-1:493370826424:secret:rds!db-43a013da-f9e2-4e79-a223-f3473ab2824d-Qzeehn"
              - secret_status = "active"
            },
        ] -> null
      - max_allocated_storage                 = 100 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = true -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:mysql-8-0" -> null
      - parameter_group_name                  = "default.mysql8.0" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 3306 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-ZS7IUWGOPXBB6P7M63J3LHQQ6E" -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = false -> null
      - storage_throughput                    = 0 -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - username                              = "keycloack_dba" -> null
      - vpc_security_group_ids                = [
          - "sg-08105b487b456cad9",
        ] -> null
    }

  # aws_db_instance.keycloak will be created
  + resource "aws_db_instance" "keycloak" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "keycloak"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "keycloak-"
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + timezone                              = (known after apply)
      + username                              = "keycloak_dba"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.keycloack will be destroyed
  # (because aws_db_subnet_group.keycloack is not in configuration)
  - resource "aws_db_subnet_group" "keycloack" {
      - arn                     = "arn:aws:rds:us-west-1:493370826424:subgrp:keycloack20240303165624397300000001" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "keycloack20240303165624397300000001" -> null
      - name                    = "keycloack20240303165624397300000001" -> null
      - name_prefix             = "keycloack" -> null
      - subnet_ids              = [
          - "subnet-06caf71c8b0afd909",
          - "subnet-0f91dd2675e7a16c3",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {} -> null
      - tags_all                = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - vpc_id                  = "vpc-08e19d859c26d18b2" -> null
    }

  # aws_db_subnet_group.keycloak will be created
  + resource "aws_db_subnet_group" "keycloak" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "keycloak"
      + subnet_ids              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_secretsmanager_secret.keycloack_service will be destroyed
  # (because aws_secretsmanager_secret.keycloack_service is not in configuration)
  - resource "aws_secretsmanager_secret" "keycloack_service" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null
      - description                    = "A JSON with username/password keys - MySQL account used by keycloack service" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null
      - name                           = "keycloack_service20240303172332198400000001" -> null
      - name_prefix                    = "keycloack_service" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
    }

  # aws_secretsmanager_secret.keycloak_service will be created
  + resource "aws_secretsmanager_secret" "keycloak_service" {
      + arn                            = (known after apply)
      + description                    = "A JSON with username/password keys - MySQL account used by keycloak service"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "keycloak_service"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_secretsmanager_secret_version.keycloack_service will be destroyed
  # (because aws_secretsmanager_secret_version.keycloack_service is not in configuration)
  - resource "aws_secretsmanager_secret_version" "keycloack_service" {
      - arn            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6|terraform-20240303172332586300000003" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20240303172332586300000003" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.keycloak_service will be created
  + resource "aws_secretsmanager_secret_version" "keycloak_service" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.keycloack will be destroyed
  # (because aws_security_group.keycloack is not in configuration)
  - resource "aws_security_group" "keycloack" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-08105b487b456cad9" -> null
      - description            = "keycloack RDS instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-08105b487b456cad9" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all ICMP traffic"
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/22",
                ]
              - description      = "Allow mysql traffic"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3306
            },
        ] -> null
      - name                   = "keycloack-db-20240303165624397300000002" -> null
      - name_prefix            = "keycloack-db-" -> null
      - owner_id               = "493370826424" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "keycloack RDS"
        } -> null
      - tags_all               = {
          - "Name"        = "keycloack RDS"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null
    }

  # aws_security_group.keycloak will be created
  + resource "aws_security_group" "keycloak" {
      + arn                    = (known after apply)
      + description            = "keycloak RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "keycloak-db-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "keycloak RDS"
        }
      + tags_all               = {
          + "Name"        = "keycloak RDS"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # aws_vpc_security_group_egress_rule.keycloack_outgoing will be destroyed
  # (because aws_vpc_security_group_egress_rule.keycloack_outgoing is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "keycloack_outgoing" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-053515ed39689c9ef" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - id                     = "sgr-053515ed39689c9ef" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-08105b487b456cad9" -> null
      - security_group_rule_id = "sgr-053515ed39689c9ef" -> null
      - tags                   = {
          - "Name" = "outgoing traffic"
        } -> null
      - tags_all               = {
          - "Name"        = "outgoing traffic"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
    }

  # aws_vpc_security_group_egress_rule.keycloak_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "keycloak_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_vpc_security_group_ingress_rule.keycloack-icmp will be destroyed
  # (because aws_vpc_security_group_ingress_rule.keycloack-icmp is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "keycloack-icmp" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-040aa25b2302fc983" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all ICMP traffic" -> null
      - from_port              = -1 -> null
      - id                     = "sgr-040aa25b2302fc983" -> null
      - ip_protocol            = "icmp" -> null
      - security_group_id      = "sg-08105b487b456cad9" -> null
      - security_group_rule_id = "sgr-040aa25b2302fc983" -> null
      - tags                   = {
          - "Name" = "ICMP traffic"
        } -> null
      - tags_all               = {
          - "Name"        = "ICMP traffic"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = -1 -> null
    }

  # aws_vpc_security_group_ingress_rule.keycloack-mysql will be destroyed
  # (because aws_vpc_security_group_ingress_rule.keycloack-mysql is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "keycloack-mysql" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0c007aa629d057d5a" -> null
      - cidr_ipv4              = "10.0.0.0/22" -> null
      - description            = "Allow mysql traffic" -> null
      - from_port              = 3306 -> null
      - id                     = "sgr-0c007aa629d057d5a" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-08105b487b456cad9" -> null
      - security_group_rule_id = "sgr-0c007aa629d057d5a" -> null
      - tags                   = {
          - "Name" = "mysql access"
        } -> null
      - tags_all               = {
          - "Name"        = "mysql access"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 3306 -> null
    }

  # aws_vpc_security_group_ingress_rule.keycloak-icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "keycloak-icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.keycloak-mysql will be created
  + resource "aws_vpc_security_group_ingress_rule" "keycloak-mysql" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow mysql traffic"
      + from_port              = 3306
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "mysql access"
        }
      + tags_all               = {
          + "Name"        = "mysql access"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 3306
    }

  # random_password.keycloack_service will be destroyed
  # (because random_password.keycloack_service is not in configuration)
  - resource "random_password" "keycloack_service" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 21 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # random_password.keycloak_service will be created
  + resource "random_password" "keycloak_service" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 21
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.keycloak.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/auth/auth"
        name                               = "auth"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:7" -> (known after apply)
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.keycloak.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "auth" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 7 -> (known after apply)
      - tags                     = {} -> null
        # (5 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.terraform_remote_state.cicd: Reading...%0Adata.terraform_remote_state.cicd: Read complete after 1s%0Amodule.keycloak.data.cloudinit_config.ecs: Reading...%0Amodule.ecs.data.cloudinit_config.ecs: Reading...%0Amodule.ecs.data.cloudinit_config.ecs: Read complete after 0s [id=4217720379]%0Amodule.keycloak.data.cloudinit_config.ecs: Read complete after 0s [id=1466757517]%0Arandom_pet.keycloak_admin_username: Refreshing state... [id=accepted-asp]%0Arandom_password.keycloack_service: Refreshing state... [id=none]%0Arandom_password.keycloak_admin_password: Refreshing state... [id=none]%0Amodule.jumphost.random_string.asg_name: Refreshing state... [id=02R7BZ]%0Amodule.release_infrahouse_com["jammy"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.release_infrahouse_com["focal"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.jumphost.random_string.profile-suffix: Refreshing state... [id=Zv01ElhajbB6]%0Amodule.ecs.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_cache_policy.default: Refreshing state... [id=5db494dd-546b-4231-a0c7-133b245ada49]%0Amodule.keycloak.data.aws_iam_policy_document.assume_role_policy: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Reading...%0Amodule.ecs.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ecs.data.aws_iam_policy.ecs-task-execution-role-policy: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_cache_policy.default: Refreshing state... [id=b04aff45-48e1-4501-90d3-998c9fa1f264]%0Amodule.keycloak.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]%0Amodule.ecs.data.aws_caller_identity.current: Reading...%0Amodule.keycloak.aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:cluster/auth]%0Amodule.ecs.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.ecs.data.aws_ami.ecs: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.keycloak.data.aws_ami.ecs: Reading...%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ecs.data.aws_ami.ecs: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.ecs.module.pod.data.aws_caller_identity.current: Reading...%0Amodule.ecs.module.pod.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.keycloak.data.aws_iam_policy.ecs-task-execution-role-policy: Reading...%0Amodule.keycloak.data.aws_ami.ecs: Read complete after 0s [id=ami-0c535e24abbf12738]%0Adata.aws_ami.ubuntu_22: Reading...%0Aaws_secretsmanager_secret.registry_client_secret: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:registry_client_secret20240302203708051000000001-UA4zRE]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-jammy_infrahouse_com-auth]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-05c969369880fa2c2]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-focal_infrahouse_com-auth]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.keycloak.data.aws_iam_policy_document.instance_policy: Reading...%0Amodule.keycloak.data.aws_iam_policy_document.instance_policy: Read complete after 0s [id=1552918899]%0Amodule.infrahouse-toolkit-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ecs.data.aws_region.current: Reading...%0Amodule.ecs.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Aaws_key_pair.aleks-Black-MBP: Refreshing state... [id=aleks-Black-MBP]%0Amodule.ecs.aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:cluster/terraform-registry]%0Amodule.jumphost.data.aws_ami.ubuntu: Reading...%0Amodule.keycloak.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.keycloak.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=83731904]%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq]%0Amodule.ecs.data.aws_iam_policy_document.instance_policy: Reading...%0Amodule.ecs.data.aws_iam_policy_document.instance_policy: Read complete after 0s [id=1552918899]%0Aaws_secretsmanager_secret.keycloak_admin_creds: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd]%0Amodule.infrahouse-toolkit-github.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.keycloak.data.aws_caller_identity.current: Reading...%0Amodule.keycloak.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.jumphost.data.aws_ami.ubuntu: Read complete after 1s [id=ami-05c969369880fa2c2]%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.keycloak.module.pod.data.aws_caller_identity.current: Reading...%0Amodule.keycloak.module.pod.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Reading...%0Amodule.keycloak.data.aws_region.current: Reading...%0Amodule.keycloak.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_origin_access_control.repo-storage: Refreshing state... [id=E19JUOM5WL9R3Q]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_origin_access_control.repo-storage: Refreshing state... [id=EMY4YRQBY9A64]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.jumphost.aws_efs_file_system.home: Refreshing state... [id=fs-0cbd3749548d04da6]%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=2218315402]%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1585346832]%0Amodule.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...%0Amodule.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=terraform-registry_instance20240302194935069800000007]%0Amodule.keycloak.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=authTaskExecutionRole]%0Adata.aws_route53_zone.cicd-ih-com: Reading...%0Aaws_vpc_security_group_ingress_rule.keycloack-mysql: Refreshing state... [id=sgr-0c007aa629d057d5a]%0Aaws_db_subnet_group.keycloack: Refreshing state... [id=keycloack20240303165624397300000001]%0Aaws_vpc_security_group_egress_rule.keycloack_outgoing: Refreshing state... [id=sgr-053515ed39689c9ef]%0Adata.aws_iam_policy_document.registry_node_permissions: Reading...%0Adata.aws_iam_policy_document.registry_node_permissions: Read complete after 0s [id=1809068043]%0Aaws_secretsmanager_secret.keycloack_service: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6]%0Aaws_db_instance.keycloack: Refreshing state... [id=db-ZS7IUWGOPXBB6P7M63J3LHQQ6E]%0Adata.aws_caller_identity.current: Reading...%0Aaws_vpc_security_group_ingress_rule.keycloack-icmp: Refreshing state... [id=sgr-040aa25b2302fc983]%0Adata.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Aaws_secretsmanager_secret_version.keycloack_service: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6|terraform-20240303172332586300000003]%0Aaws_security_group.keycloack: Refreshing state... [id=sg-08105b487b456cad9]%0Adata.aws_region.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-west-1]%0Adata.aws_secretsmanager_secret_version.registry_client_secret: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=290351380]%0Adata.aws_secretsmanager_secret_version.registry_client_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:registry_client_secret20240302203708051000000001-UA4zRE|AWSCURRENT]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=auth_instance20240302223634852000000001]%0Adata.aws_route53_zone.cicd-ih-com: Read complete after 1s [id=Z06790082OU0POPWOCPZ4]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-aws-control-493370826424-github]%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2423520793]%0Amodule.infrahouse-toolkit-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=4107919091]%0Aaws_secretsmanager_secret_version.keycloak_admin_creds: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd|terraform-20240302224352723300000003]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-focal]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-infrahouse-website-infra-github]%0Amodule.ecs.data.aws_iam_policy.ecs-task-execution-role-policy: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Amodule.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=terraform-registryTaskExecutionRole]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_logging.server-logs: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_logging.server-logs: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=terraform-registry_instance]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.keycloak.data.aws_iam_policy.ecs-task-execution-role-policy: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Aaws_iam_policy.registry_node: Refreshing state... [id=arn:aws:iam::493370826424:policy/registry-node-20240303052126090300000001]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Adata.aws_iam_policy_document.registry_node_assume: Reading...%0Adata.aws_iam_policy_document.registry_node_assume: Read complete after 0s [id=3719449782]%0Amodule.ecs.module.pod.data.aws_ami.selected: Reading...%0Amodule.keycloak.module.pod.data.aws_ami.selected: Reading...%0Amodule.ecs.module.pod.data.aws_ami.selected: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0ac1c23091a58b0bd]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-032c75541921bd8f1]%0Amodule.keycloak.module.pod.data.aws_ami.selected: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-04b8845d896c6ebde]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-06caf71c8b0afd909]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.infrahouse-puppet-data-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github]%0Amodule.ecs.data.aws_key_pair.ssh_key_pair: Reading...%0Amodule.keycloak.data.aws_key_pair.ssh_key_pair: Reading...%0Amodule.puppet-code-github.aws_iam_role.github: Refreshing state... [id=ih-tf-puppet-code-github]%0Amodule.infrahouse-toolkit-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-toolkit-github]%0Amodule.ecs.data.aws_key_pair.ssh_key_pair: Read complete after 0s [id=key-09febf212ac7461a1]%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Reading...%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Read complete after 0s [id=1754214164]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost-Zv01ElhajbB620240223005112022800000002]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=auth_instance]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-focal,private]%0Amodule.keycloak.data.aws_key_pair.ssh_key_pair: Read complete after 0s [id=key-09febf212ac7461a1]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-jammy,private]%0Aaws_route53_record.ci-cd-ns: Refreshing state... [id=Z07662251LH3YRF2ERM3G_ci-cd.infrahouse.com_NS]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs,private]%0Amodule.keycloak.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=authTaskExecutionRole-20240302223635181000000008]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost-Zv01ElhajbB6]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Aaws_iam_role.registry-node: Refreshing state... [id=registry-node-20240303052126090700000002]%0Amodule.management.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0e1eea4ce5b798046]%0Amodule.management.aws_vpc_security_group_ingress_rule.default[0]: Refreshing state... [id=sgr-06140053abc62a119]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-0a3949a8a5f094171]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003]%0Amodule.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=terraform-registryTaskExecutionRole-20240302194935897700000009]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0ac1c23091a58b0bd1080289494]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=709841391]%0Aaws_iam_role.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github]%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Read complete after 0s [id=1709618770]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-01521500562fd17b0]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-03418f8ebac8aa40b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Reading...%0Amodule.release_infrahouse_com["focal"].aws_route53_record.cert_validation["release-focal.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__87f2ead3abf68134c497bf52718e07b1.release-focal.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.cert_validation["release-jammy.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__047ae29925ec0297eaebfeddc886f234.release-jammy.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-focal.infrahouse.com]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-jammy.infrahouse.com]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005112691200000007]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-0d4e2ee96452d86fe]%0Amodule.ecs.module.pod.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.keycloak.module.pod.data.aws_route53_zone.webserver_zone: Reading...%0Aaws_iam_role_policy_attachment.task_role: Refreshing state... [id=registry-node-20240303052126090700000002-20240303052126601400000003]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=auth_instance20240302223634852000000001-20240302223635213800000009]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=terraform-registry_instance20240302194935069800000007-20240302194935884600000008]%0Amodule.jumphost.data.aws_subnet.nlb_selected: Reading...%0Amodule.ecs.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_subnet.selected: Reading...%0Amodule.keycloak.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_subnet.nlb_selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.ecs.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-032c75541921bd8f11080289494]%0Amodule.jumphost.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.ecs.module.pod.data.aws_subnet.selected: Reading...%0Amodule.ecs.aws_ecs_task_definition.ecs: Refreshing state... [id=terraform-registry]%0Amodule.keycloak.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.051 +0000 UTC]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.442 +0000 UTC]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.keycloak.module.pod.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_vpc.nlb_selected: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[0]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[0]: Read complete after 0s [id=4198845318]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[1]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[1]: Read complete after 0s [id=3967319674]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[2]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[2]: Read complete after 0s [id=2166003714]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[2]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[2]: Read complete after 0s [id=62441911]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[0]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[0]: Read complete after 0s [id=571510222]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[1]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[1]: Read complete after 0s [id=1286761665]%0Amodule.ecs.aws_security_group.backend_extra: Refreshing state... [id=sg-0df97e04eee18cc72]%0Amodule.keycloak.module.pod.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.ecs.module.pod.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.jumphost.aws_security_group.efs: Refreshing state... [id=sg-02906b36c9d1be156]%0Amodule.jumphost.aws_security_group.jumphost: Refreshing state... [id=sg-0bc8f2feda3620f6f]%0Amodule.jumphost.data.aws_vpc.selected: Reading...%0Amodule.keycloak.aws_security_group.backend_extra: Refreshing state... [id=sg-08cca82b25623d4ee]%0Amodule.keycloak.aws_ecs_task_definition.ecs: Refreshing state... [id=auth]%0Amodule.keycloak.module.pod.data.aws_vpc.service: Reading...%0Amodule.ecs.module.pod.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.keycloak.module.pod.aws_security_group.alb: Refreshing state... [id=sg-04a8761a74826b4f8]%0Amodule.keycloak.module.pod.aws_security_group.backend: Refreshing state... [id=sg-06533e906d784b2a5]%0Amodule.keycloak.module.pod.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59]%0Amodule.ecs.module.pod.data.aws_vpc.service: Reading...%0Amodule.ecs.module.pod.aws_security_group.backend: Refreshing state... [id=sg-04b9363834e13a23e]%0Amodule.ecs.module.pod.aws_security_group.alb: Refreshing state... [id=sg-048f21fa3499d69af]%0Amodule.keycloak.module.pod.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.ecs.module.pod.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302194935067400000002/c7f427e0e1d228fe]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github-20230818034150993400000001]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2714260376]%0Amodule.ecs.aws_vpc_security_group_ingress_rule.backend_extra_user: Refreshing state... [id=sgr-02b52993d3250d3a0]%0Amodule.ecs.aws_vpc_security_group_ingress_rule.backend_extra_reserved: Refreshing state... [id=sgr-000ecebf750fc1bf1]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.ssh: Refreshing state... [id=sgr-08214d93ee7212b60]%0Amodule.jumphost.data.aws_vpc.selected: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_lb.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/jumpho20240226175403880200000003/b3fc749d99e1aea6]%0Amodule.jumphost.aws_vpc_security_group_egress_rule.default: Refreshing state... [id=sgr-09df3a8ea086f41c3]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.icmp: Refreshing state... [id=sgr-0335952ea4ac17465]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-001743d1d2257c40b]%0Amodule.jumphost.aws_vpc_security_group_egress_rule.efs: Refreshing state... [id=sgr-0db18bc63ee576445]%0Amodule.keycloak.module.pod.data.aws_vpc.service: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_efs_mount_target.packages["subnet-0f91dd2675e7a16c3"]: Refreshing state... [id=fsmt-0d025cfc9c7ee2852]%0Amodule.jumphost.data.aws_vpc.nlb_selected: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_efs_mount_target.packages["subnet-06caf71c8b0afd909"]: Refreshing state... [id=fsmt-05668d06fda5b96b6]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.efs_icmp: Refreshing state... [id=sgr-05152071ab2f7b9e3]%0Amodule.ecs.module.pod.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/32a7b391-4cc3-48ff-8fc1-3f4994a9b351]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2899629952]%0Amodule.ecs.module.pod.data.aws_vpc.service: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github-20230817010818258200000001]%0Amodule.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_user: Refreshing state... [id=sgr-0fb261fe3f35597f1]%0Amodule.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_reserved: Refreshing state... [id=sgr-08439d8ce172557ba]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo: Refreshing state... [id=E161QGCPE3JIOK]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo: Refreshing state... [id=E1IILWIY0OU78B]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp: Refreshing state... [id=sgr-05b0c467d0cc6084a]%0Amodule.keycloak.module.pod.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a]%0Amodule.keycloak.module.pod.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port: Refreshing state... [id=sgr-0cc902990fde04156]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https: Refreshing state... [id=sgr-08092ae9826c38ee9]%0Amodule.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing: Refreshing state... [id=sgr-08c12a045e8ba9745]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input: Refreshing state... [id=sgr-0ec0eed9f3d8a3ab7]%0Amodule.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing: Refreshing state... [id=sgr-084a4b4a7956275e6]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp: Refreshing state... [id=sgr-0da95d368ec0bcbdb]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port: Refreshing state... [id=sgr-0c5501ac99c777076]%0Amodule.ecs.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing: Refreshing state... [id=sgr-0ff88016915a07fda]%0Amodule.ecs.module.pod.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/terraf2024030219493612940000000a/1f20b225c3278266]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.https: Refreshing state... [id=sgr-0a32d4cf4fe9ff4af]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp: Refreshing state... [id=sgr-0e10c5523b00f7c23]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp: Refreshing state... [id=sgr-043d02ddfb9745980]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input: Refreshing state... [id=sgr-07a5dea5dbb291aae]%0Amodule.ecs.module.pod.aws_launch_template.website: Refreshing state... [id=lt-0b338e0594e73e11a]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.efs: Refreshing state... [id=sgr-011e2fea66d74b99f]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local: Refreshing state... [id=sgr-0bbb79202dde3e83d]%0Amodule.ecs.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing: Refreshing state... [id=sgr-0de12114d80af02de]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic: Refreshing state... [id=sgr-0d168218efcb7219b]%0Amodule.jumphost.aws_lb_target_group.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/jumpho20240226175402900300000002/e819b391374f847e]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic: Refreshing state... [id=sgr-06aec0ef1d95a1378]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local: Refreshing state... [id=sgr-004893c7e1cf4250f]%0Amodule.keycloak.module.pod.aws_launch_template.website: Refreshing state... [id=lt-0d93139ab32de43aa]%0Amodule.jumphost.aws_route53_record.jumphost_cname: Refreshing state... [id=Z07662251LH3YRF2ERM3G_jumphost.infrahouse.com_CNAME]%0Amodule.keycloak.module.pod.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/3f453601d67d421e]%0Amodule.keycloak.module.pod.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_auth.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_route53_record.cert_validation["registry.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__bec7dafd8b0071d5633275441f36976e.registry.infrahouse.com._CNAME]%0Amodule.keycloak.module.pod.aws_route53_record.cert_validation["auth.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access: Read complete after 0s [id=133085117]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access: Read complete after 0s [id=3872546644]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-focal.infrahouse.com_A]%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-jammy.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_autoscaling_group.website: Refreshing state... [id=terraf2024030219493674520000000d]%0Amodule.ecs.module.pod.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/9c419e4a169d61e1]%0Amodule.ecs.module.pod.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_registry.infrahouse.com_A]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access: Read complete after 0s [id=2929434109]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access: Read complete after 0s [id=4209130619]%0Amodule.jumphost.aws_lb_listener.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/net/jumpho20240226175403880200000003/b3fc749d99e1aea6/91aca9d503ce64cc]%0Amodule.keycloak.module.pod.aws_autoscaling_group.website: Refreshing state... [id=auth2024030222363784960000000d]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20240223005113359100000009-02R7BZ]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin-20230818034158985100000002]%0Amodule.ecs.module.pod.aws_autoscaling_policy.cpu_load: Refreshing state... [id=terraf2024030219493674520000000d]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access: Refreshing state... [id=infrahouse-release-focal]%0Amodule.keycloak.module.pod.aws_acm_certificate_validation.website: Refreshing state... [id=2024-03-02 22:36:51.087 +0000 UTC]%0Amodule.ecs.module.pod.aws_acm_certificate_validation.website: Refreshing state... [id=2024-03-02 19:49:53.063 +0000 UTC]%0Amodule.ecs.aws_ecs_capacity_provider.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:capacity-provider/terraform-registry]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.keycloak.module.pod.aws_autoscaling_policy.cpu_load: Refreshing state... [id=auth2024030222363784960000000d]%0Amodule.keycloak.aws_ecs_capacity_provider.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth]%0Adata.aws_iam_policy_document.package-publisher: Reading...%0Adata.aws_iam_policy_document.package-publisher: Read complete after 0s [id=4050006037]%0Amodule.jumphost.data.aws_iam_policy_document.required_permissions: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.required_permissions: Read complete after 0s [id=485487314]%0Aaws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]%0Amodule.jumphost.aws_iam_policy.required: Refreshing state... [id=arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014]%0Amodule.ecs.aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=terraform-registry]%0Amodule.ecs.aws_ecs_service.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry]%0Amodule.keycloak.aws_ecs_service.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:service/auth/auth]%0Amodule.keycloak.aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=auth]%0Amodule.keycloak.module.pod.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df]%0Amodule.ecs.module.pod.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/3a119c99d9f74ead]%0Amodule.keycloak.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/auth/auth]%0Amodule.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/terraform-registry/terraform-registry]%0Amodule.keycloak.aws_appautoscaling_policy.ecs_policy: Refreshing state... [id=cpu-auto-scaling]%0Aaws_iam_role_policy_attachment.infrahouse-puppet-data-github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github-20231108133200175400000001]%0Aaws_iam_role_policy_attachment.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github-20230819214139756300000001]%0Aaws_iam_role_policy_attachment.puppet-code-github: Refreshing state... [id=ih-tf-puppet-code-github-20231108132248583100000001]%0Aaws_iam_role_policy_attachment.infrahouse-toolkit-github: Refreshing state... [id=ih-tf-infrahouse-toolkit-github-20240229205019467600000001]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"]: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146325300000016]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146320100000015]%0Amodule.ecs.aws_appautoscaling_policy.ecs_policy: Refreshing state... [id=cpu-auto-scaling]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.keycloack will be destroyed%0A  # (because aws_db_instance.keycloack is not in configuration)%0A  - resource "aws_db_instance" "keycloack" {%0A      - address                               = "keycloack-20240303165626288600000003.c2uzeb8enbyb.us-west-1.rds.amazonaws.com" -> null%0A      - allocated_storage                     = 10 -> null%0A      - apply_immediately                     = false -> null%0A      - arn                                   = "arn:aws:rds:us-west-1:493370826424:db:keycloack-20240303165626288600000003" -> null%0A      - auto_minor_version_upgrade            = true -> null%0A      - availability_zone                     = "us-west-1c" -> null%0A      - backup_retention_period               = 7 -> null%0A      - backup_target                         = "region" -> null%0A      - backup_window                         = "12:45-13:15" -> null%0A      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null%0A      - copy_tags_to_snapshot                 = false -> null%0A      - customer_owned_ip_enabled             = false -> null%0A      - db_name                               = "keycloack" -> null%0A      - db_subnet_group_name                  = "keycloack20240303165624397300000001" -> null%0A      - delete_automated_backups              = true -> null%0A      - deletion_protection                   = false -> null%0A      - domain_dns_ips                        = [] -> null%0A      - enabled_cloudwatch_logs_exports       = [] -> null%0A      - endpoint                              = "keycloack-20240303165626288600000003.c2uzeb8enbyb.us-west-1.rds.amazonaws.com:3306" -> null%0A      - engine                                = "mysql" -> null%0A      - engine_version                        = "8.0" -> null%0A      - engine_version_actual                 = "8.0.35" -> null%0A      - hosted_zone_id                        = "Z10WI91S59XXQN" -> null%0A      - iam_database_authentication_enabled   = false -> null%0A      - id                                    = "db-ZS7IUWGOPXBB6P7M63J3LHQQ6E" -> null%0A      - identifier                            = "keycloack-20240303165626288600000003" -> null%0A      - identifier_prefix                     = "keycloack-" -> null%0A      - instance_class                        = "db.t3.micro" -> null%0A      - iops                                  = 0 -> null%0A      - latest_restorable_time                = "2024-03-03T17:35:00Z" -> null%0A      - license_model                         = "general-public-license" -> null%0A      - listener_endpoint                     = [] -> null%0A      - maintenance_window                    = "tue:12:07-tue:12:37" -> null%0A      - manage_master_user_password           = true -> null%0A      - master_user_secret                    = [%0A          - {%0A              - kms_key_id    = "arn:aws:kms:us-west-1:493370826424:key/4f32be31-ea72-4046-bafa-ea0a61a58cee"%0A              - secret_arn    = "arn:aws:secretsmanager:us-west-1:493370826424:secret:rds!db-43a013da-f9e2-4e79-a223-f3473ab2824d-Qzeehn"%0A              - secret_status = "active"%0A            },%0A        ] -> null%0A      - max_allocated_storage                 = 100 -> null%0A      - monitoring_interval                   = 0 -> null%0A      - multi_az                              = true -> null%0A      - network_type                          = "IPV4" -> null%0A      - option_group_name                     = "default:mysql-8-0" -> null%0A      - parameter_group_name                  = "default.mysql8.0" -> null%0A      - performance_insights_enabled          = false -> null%0A      - performance_insights_retention_period = 0 -> null%0A      - port                                  = 3306 -> null%0A      - publicly_accessible                   = false -> null%0A      - replicas                              = [] -> null%0A      - resource_id                           = "db-ZS7IUWGOPXBB6P7M63J3LHQQ6E" -> null%0A      - skip_final_snapshot                   = false -> null%0A      - status                                = "available" -> null%0A      - storage_encrypted                     = false -> null%0A      - storage_throughput                    = 0 -> null%0A      - storage_type                          = "gp2" -> null%0A      - tags                                  = {} -> null%0A      - tags_all                              = {%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A      - username                              = "keycloack_dba" -> null%0A      - vpc_security_group_ids                = [%0A          - "sg-08105b487b456cad9",%0A        ] -> null%0A    }%0A%0A  # aws_db_instance.keycloak will be created%0A  + resource "aws_db_instance" "keycloak" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = 7%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "keycloak"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + deletion_protection                   = true%0A      + domain_fqdn                           = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "mysql"%0A      + engine_version                        = "8.0"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = (known after apply)%0A      + identifier_prefix                     = "keycloak-"%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + manage_master_user_password           = true%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + max_allocated_storage                 = 100%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = true%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = false%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags_all                              = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "keycloak_dba"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_db_subnet_group.keycloack will be destroyed%0A  # (because aws_db_subnet_group.keycloack is not in configuration)%0A  - resource "aws_db_subnet_group" "keycloack" {%0A      - arn                     = "arn:aws:rds:us-west-1:493370826424:subgrp:keycloack20240303165624397300000001" -> null%0A      - description             = "Managed by Terraform" -> null%0A      - id                      = "keycloack20240303165624397300000001" -> null%0A      - name                    = "keycloack20240303165624397300000001" -> null%0A      - name_prefix             = "keycloack" -> null%0A      - subnet_ids              = [%0A          - "subnet-06caf71c8b0afd909",%0A          - "subnet-0f91dd2675e7a16c3",%0A        ] -> null%0A      - supported_network_types = [%0A          - "IPV4",%0A        ] -> null%0A      - tags                    = {} -> null%0A      - tags_all                = {%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A      - vpc_id                  = "vpc-08e19d859c26d18b2" -> null%0A    }%0A%0A  # aws_db_subnet_group.keycloak will be created%0A  + resource "aws_db_subnet_group" "keycloak" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = (known after apply)%0A      + name_prefix             = "keycloak"%0A      + subnet_ids              = [%0A          + "subnet-06caf71c8b0afd909",%0A          + "subnet-0f91dd2675e7a16c3",%0A        ]%0A      + supported_network_types = (known after apply)%0A      + tags_all                = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # aws_secretsmanager_secret.keycloack_service will be destroyed%0A  # (because aws_secretsmanager_secret.keycloack_service is not in configuration)%0A  - resource "aws_secretsmanager_secret" "keycloack_service" {%0A      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null%0A      - description                    = "A JSON with username/password keys - MySQL account used by keycloack service" -> null%0A      - force_overwrite_replica_secret = false -> null%0A      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null%0A      - name                           = "keycloack_service20240303172332198400000001" -> null%0A      - name_prefix                    = "keycloack_service" -> null%0A      - recovery_window_in_days        = 0 -> null%0A      - tags                           = {} -> null%0A      - tags_all                       = {%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A    }%0A%0A  # aws_secretsmanager_secret.keycloak_service will be created%0A  + resource "aws_secretsmanager_secret" "keycloak_service" {%0A      + arn                            = (known after apply)%0A      + description                    = "A JSON with username/password keys - MySQL account used by keycloak service"%0A      + force_overwrite_replica_secret = false%0A      + id                             = (known after apply)%0A      + name                           = (known after apply)%0A      + name_prefix                    = "keycloak_service"%0A      + policy                         = (known after apply)%0A      + recovery_window_in_days        = 0%0A      + tags_all                       = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # aws_secretsmanager_secret_version.keycloack_service will be destroyed%0A  # (because aws_secretsmanager_secret_version.keycloack_service is not in configuration)%0A  - resource "aws_secretsmanager_secret_version" "keycloack_service" {%0A      - arn            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null%0A      - id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6|terraform-20240303172332586300000003" -> null%0A      - secret_id      = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloack_service20240303172332198400000001-P6rvD6" -> null%0A      - secret_string  = (sensitive value) -> null%0A      - version_id     = "terraform-20240303172332586300000003" -> null%0A      - version_stages = [%0A          - "AWSCURRENT",%0A        ] -> null%0A    }%0A%0A  # aws_secretsmanager_secret_version.keycloak_service will be created%0A  + resource "aws_secretsmanager_secret_version" "keycloak_service" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + secret_id      = (known after apply)%0A      + secret_string  = (sensitive value)%0A      + version_id     = (known after apply)%0A      + version_stages = (known after apply)%0A    }%0A%0A  # aws_security_group.keycloack will be destroyed%0A  # (because aws_security_group.keycloack is not in configuration)%0A  - resource "aws_security_group" "keycloack" {%0A      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-08105b487b456cad9" -> null%0A      - description            = "keycloack RDS instance" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-08105b487b456cad9" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "Allow all ICMP traffic"%0A              - from_port        = -1%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "icmp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = -1%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.0.0.0/22",%0A                ]%0A              - description      = "Allow mysql traffic"%0A              - from_port        = 3306%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 3306%0A            },%0A        ] -> null%0A      - name                   = "keycloack-db-20240303165624397300000002" -> null%0A      - name_prefix            = "keycloack-db-" -> null%0A      - owner_id               = "493370826424" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "keycloack RDS"%0A        } -> null%0A      - tags_all               = {%0A          - "Name"        = "keycloack RDS"%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null%0A    }%0A%0A  # aws_security_group.keycloak will be created%0A  + resource "aws_security_group" "keycloak" {%0A      + arn                    = (known after apply)%0A      + description            = "keycloak RDS instance"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "keycloak-db-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "keycloak RDS"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "keycloak RDS"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                 = "vpc-08e19d859c26d18b2"%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.keycloack_outgoing will be destroyed%0A  # (because aws_vpc_security_group_egress_rule.keycloack_outgoing is not in configuration)%0A  - resource "aws_vpc_security_group_egress_rule" "keycloack_outgoing" {%0A      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-053515ed39689c9ef" -> null%0A      - cidr_ipv4              = "0.0.0.0/0" -> null%0A      - id                     = "sgr-053515ed39689c9ef" -> null%0A      - ip_protocol            = "-1" -> null%0A      - security_group_id      = "sg-08105b487b456cad9" -> null%0A      - security_group_rule_id = "sgr-053515ed39689c9ef" -> null%0A      - tags                   = {%0A          - "Name" = "outgoing traffic"%0A        } -> null%0A      - tags_all               = {%0A          - "Name"        = "outgoing traffic"%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.keycloak_outgoing will be created%0A  + resource "aws_vpc_security_group_egress_rule" "keycloak_outgoing" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "outgoing traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "outgoing traffic"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.keycloack-icmp will be destroyed%0A  # (because aws_vpc_security_group_ingress_rule.keycloack-icmp is not in configuration)%0A  - resource "aws_vpc_security_group_ingress_rule" "keycloack-icmp" {%0A      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-040aa25b2302fc983" -> null%0A      - cidr_ipv4              = "0.0.0.0/0" -> null%0A      - description            = "Allow all ICMP traffic" -> null%0A      - from_port              = -1 -> null%0A      - id                     = "sgr-040aa25b2302fc983" -> null%0A      - ip_protocol            = "icmp" -> null%0A      - security_group_id      = "sg-08105b487b456cad9" -> null%0A      - security_group_rule_id = "sgr-040aa25b2302fc983" -> null%0A      - tags                   = {%0A          - "Name" = "ICMP traffic"%0A        } -> null%0A      - tags_all               = {%0A          - "Name"        = "ICMP traffic"%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A      - to_port                = -1 -> null%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.keycloack-mysql will be destroyed%0A  # (because aws_vpc_security_group_ingress_rule.keycloack-mysql is not in configuration)%0A  - resource "aws_vpc_security_group_ingress_rule" "keycloack-mysql" {%0A      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0c007aa629d057d5a" -> null%0A      - cidr_ipv4              = "10.0.0.0/22" -> null%0A      - description            = "Allow mysql traffic" -> null%0A      - from_port              = 3306 -> null%0A      - id                     = "sgr-0c007aa629d057d5a" -> null%0A      - ip_protocol            = "tcp" -> null%0A      - security_group_id      = "sg-08105b487b456cad9" -> null%0A      - security_group_rule_id = "sgr-0c007aa629d057d5a" -> null%0A      - tags                   = {%0A          - "Name" = "mysql access"%0A        } -> null%0A      - tags_all               = {%0A          - "Name"        = "mysql access"%0A          - "created_by"  = "infrahouse/aws-control-493370826424"%0A          - "environment" = "production"%0A        } -> null%0A      - to_port                = 3306 -> null%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.keycloak-icmp will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "keycloak-icmp" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow all ICMP traffic"%0A      + from_port              = -1%0A      + id                     = (known after apply)%0A      + ip_protocol            = "icmp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "ICMP traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "ICMP traffic"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + to_port                = -1%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.keycloak-mysql will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "keycloak-mysql" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.0.0/22"%0A      + description            = "Allow mysql traffic"%0A      + from_port              = 3306%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "mysql access"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "mysql access"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 3306%0A    }%0A%0A  # random_password.keycloack_service will be destroyed%0A  # (because random_password.keycloack_service is not in configuration)%0A  - resource "random_password" "keycloack_service" {%0A      - bcrypt_hash = (sensitive value) -> null%0A      - id          = "none" -> null%0A      - length      = 21 -> null%0A      - lower       = true -> null%0A      - min_lower   = 0 -> null%0A      - min_numeric = 0 -> null%0A      - min_special = 0 -> null%0A      - min_upper   = 0 -> null%0A      - number      = true -> null%0A      - numeric     = true -> null%0A      - result      = (sensitive value) -> null%0A      - special     = true -> null%0A      - upper       = true -> null%0A    }%0A%0A  # random_password.keycloak_service will be created%0A  + resource "random_password" "keycloak_service" {%0A      + bcrypt_hash = (sensitive value)%0A      + id          = (known after apply)%0A      + length      = 21%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (sensitive value)%0A      + special     = true%0A      + upper       = true%0A    }%0A%0A  # module.keycloak.aws_ecs_service.ecs will be updated in-place%0A  ~ resource "aws_ecs_service" "ecs" {%0A        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/auth/auth"%0A        name                               = "auth"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:7" -> (known after apply)%0A        # (13 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.keycloak.aws_ecs_task_definition.ecs must be replaced%0A-/+ resource "aws_ecs_task_definition" "ecs" {%0A      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:7" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "auth" -> (known after apply)%0A      + network_mode             = (known after apply)%0A      - requires_compatibilities = [] -> null%0A      ~ revision                 = 7 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 10 to add, 1 to change, 10 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG4gIC0gZGVzdHJveVxuLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2RiX2luc3RhbmNlLmtleWNsb2FjayB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIGF3c19kYl9pbnN0YW5jZS5rZXljbG9hY2sgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfZGJfaW5zdGFuY2VcIiBcImtleWNsb2Fja1wiIHtcbiAgICAgIC0gYWRkcmVzcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrLTIwMjQwMzAzMTY1NjI2Mjg4NjAwMDAwMDAzLmMydXplYjhlbmJ5Yi51cy13ZXN0LTEucmRzLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsXG4gICAgICAtIGFsbG9jYXRlZF9zdG9yYWdlICAgICAgICAgICAgICAgICAgICAgPSAxMCAtPiBudWxsXG4gICAgICAtIGFwcGx5X2ltbWVkaWF0ZWx5ICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6cmRzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6ZGI6a2V5Y2xvYWNrLTIwMjQwMzAzMTY1NjI2Mjg4NjAwMDAwMDAzXCIgLT4gbnVsbFxuICAgICAgLSBhdXRvX21pbm9yX3ZlcnNpb25fdXBncmFkZSAgICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMWNcIiAtPiBudWxsXG4gICAgICAtIGJhY2t1cF9yZXRlbnRpb25fcGVyaW9kICAgICAgICAgICAgICAgPSA3IC0+IG51bGxcbiAgICAgIC0gYmFja3VwX3RhcmdldCAgICAgICAgICAgICAgICAgICAgICAgICA9IFwicmVnaW9uXCIgLT4gbnVsbFxuICAgICAgLSBiYWNrdXBfd2luZG93ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIxMjo0NS0xMzoxNVwiIC0+IG51bGxcbiAgICAgIC0gY2FfY2VydF9pZGVudGlmaWVyICAgICAgICAgICAgICAgICAgICA9IFwicmRzLWNhLXJzYTIwNDgtZzFcIiAtPiBudWxsXG4gICAgICAtIGNvcHlfdGFnc190b19zbmFwc2hvdCAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGN1c3RvbWVyX293bmVkX2lwX2VuYWJsZWQgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRiX25hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2Fja1wiIC0+IG51bGxcbiAgICAgIC0gZGJfc3VibmV0X2dyb3VwX25hbWUgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrMjAyNDAzMDMxNjU2MjQzOTczMDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIGRlbGV0ZV9hdXRvbWF0ZWRfYmFja3VwcyAgICAgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gZGVsZXRpb25fcHJvdGVjdGlvbiAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gZG9tYWluX2Ruc19pcHMgICAgICAgICAgICAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gZW5hYmxlZF9jbG91ZHdhdGNoX2xvZ3NfZXhwb3J0cyAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrLTIwMjQwMzAzMTY1NjI2Mjg4NjAwMDAwMDAzLmMydXplYjhlbmJ5Yi51cy13ZXN0LTEucmRzLmFtYXpvbmF3cy5jb206MzMwNlwiIC0+IG51bGxcbiAgICAgIC0gZW5naW5lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwibXlzcWxcIiAtPiBudWxsXG4gICAgICAtIGVuZ2luZV92ZXJzaW9uICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjguMFwiIC0+IG51bGxcbiAgICAgIC0gZW5naW5lX3ZlcnNpb25fYWN0dWFsICAgICAgICAgICAgICAgICA9IFwiOC4wLjM1XCIgLT4gbnVsbFxuICAgICAgLSBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMTBXSTkxUzU5WFhRTlwiIC0+IG51bGxcbiAgICAgIC0gaWFtX2RhdGFiYXNlX2F1dGhlbnRpY2F0aW9uX2VuYWJsZWQgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZGItWlM3SVVXR09QWEJCNlA3TTYzSjNMSFFRNkVcIiAtPiBudWxsXG4gICAgICAtIGlkZW50aWZpZXIgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2Fjay0yMDI0MDMwMzE2NTYyNjI4ODYwMDAwMDAwM1wiIC0+IG51bGxcbiAgICAgIC0gaWRlbnRpZmllcl9wcmVmaXggICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrLVwiIC0+IG51bGxcbiAgICAgIC0gaW5zdGFuY2VfY2xhc3MgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZGIudDMubWljcm9cIiAtPiBudWxsXG4gICAgICAtIGlvcHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGxcbiAgICAgIC0gbGF0ZXN0X3Jlc3RvcmFibGVfdGltZSAgICAgICAgICAgICAgICA9IFwiMjAyNC0wMy0wM1QxNzozNTowMFpcIiAtPiBudWxsXG4gICAgICAtIGxpY2Vuc2VfbW9kZWwgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdlbmVyYWwtcHVibGljLWxpY2Vuc2VcIiAtPiBudWxsXG4gICAgICAtIGxpc3RlbmVyX2VuZHBvaW50ICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsXG4gICAgICAtIG1haW50ZW5hbmNlX3dpbmRvdyAgICAgICAgICAgICAgICAgICAgPSBcInR1ZToxMjowNy10dWU6MTI6MzdcIiAtPiBudWxsXG4gICAgICAtIG1hbmFnZV9tYXN0ZXJfdXNlcl9wYXNzd29yZCAgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gbWFzdGVyX3VzZXJfc2VjcmV0ICAgICAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBrbXNfa2V5X2lkICAgID0gXCJhcm46YXdzOmttczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmtleS80ZjMyYmUzMS1lYTcyLTQwNDYtYmFmYS1lYTBhNjFhNThjZWVcIlxuICAgICAgICAgICAgICAtIHNlY3JldF9hcm4gICAgPSBcImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cmRzIWRiLTQzYTAxM2RhLWY5ZTItNGU3OS1hMjIzLWYzNDczYWIyODI0ZC1RemVlaG5cIlxuICAgICAgICAgICAgICAtIHNlY3JldF9zdGF0dXMgPSBcImFjdGl2ZVwiXG4gICAgICAgICAgICB9LFxuICAgICAgICBdIC0+IG51bGxcbiAgICAgIC0gbWF4X2FsbG9jYXRlZF9zdG9yYWdlICAgICAgICAgICAgICAgICA9IDEwMCAtPiBudWxsXG4gICAgICAtIG1vbml0b3JpbmdfaW50ZXJ2YWwgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGxcbiAgICAgIC0gbXVsdGlfYXogICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBuZXR3b3JrX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJJUFY0XCIgLT4gbnVsbFxuICAgICAgLSBvcHRpb25fZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgICAgID0gXCJkZWZhdWx0Om15c3FsLTgtMFwiIC0+IG51bGxcbiAgICAgIC0gcGFyYW1ldGVyX2dyb3VwX25hbWUgICAgICAgICAgICAgICAgICA9IFwiZGVmYXVsdC5teXNxbDguMFwiIC0+IG51bGxcbiAgICAgIC0gcGVyZm9ybWFuY2VfaW5zaWdodHNfZW5hYmxlZCAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gcGVyZm9ybWFuY2VfaW5zaWdodHNfcmV0ZW50aW9uX3BlcmlvZCA9IDAgLT4gbnVsbFxuICAgICAgLSBwb3J0ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gMzMwNiAtPiBudWxsXG4gICAgICAtIHB1YmxpY2x5X2FjY2Vzc2libGUgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIHJlcGxpY2FzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsXG4gICAgICAtIHJlc291cmNlX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImRiLVpTN0lVV0dPUFhCQjZQN002M0ozTEhRUTZFXCIgLT4gbnVsbFxuICAgICAgLSBza2lwX2ZpbmFsX3NuYXBzaG90ICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhdmFpbGFibGVcIiAtPiBudWxsXG4gICAgICAtIHN0b3JhZ2VfZW5jcnlwdGVkICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIHN0b3JhZ2VfdGhyb3VnaHB1dCAgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGxcbiAgICAgIC0gc3RvcmFnZV90eXBlICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZ3AyXCIgLT4gbnVsbFxuICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgLSB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgLSBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9IC0+IG51bGxcbiAgICAgIC0gdXNlcm5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrX2RiYVwiIC0+IG51bGxcbiAgICAgIC0gdnBjX3NlY3VyaXR5X2dyb3VwX2lkcyAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAtIFwic2ctMDgxMDViNDg3YjQ1NmNhZDlcIixcbiAgICAgICAgXSAtPiBudWxsXG4gICAgfVxuXG4gICMgYXdzX2RiX2luc3RhbmNlLmtleWNsb2FrIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2RiX2luc3RhbmNlXCIgXCJrZXljbG9ha1wiIHtcbiAgICAgICsgYWRkcmVzcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYWxsb2NhdGVkX3N0b3JhZ2UgICAgICAgICAgICAgICAgICAgICA9IDEwXG4gICAgICArIGFwcGx5X2ltbWVkaWF0ZWx5ICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhdXRvX21pbm9yX3ZlcnNpb25fdXBncmFkZSAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBiYWNrdXBfcmV0ZW50aW9uX3BlcmlvZCAgICAgICAgICAgICAgID0gN1xuICAgICAgKyBiYWNrdXBfdGFyZ2V0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBiYWNrdXBfd2luZG93ICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjYV9jZXJ0X2lkZW50aWZpZXIgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaGFyYWN0ZXJfc2V0X25hbWUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjb3B5X3RhZ3NfdG9fc25hcHNob3QgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgZGJfbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWtcIlxuICAgICAgKyBkYl9zdWJuZXRfZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZWxldGVfYXV0b21hdGVkX2JhY2t1cHMgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBkZWxldGlvbl9wcm90ZWN0aW9uICAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBkb21haW5fZnFkbiAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmRwb2ludCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmdpbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJteXNxbFwiXG4gICAgICArIGVuZ2luZV92ZXJzaW9uICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjguMFwiXG4gICAgICArIGVuZ2luZV92ZXJzaW9uX2FjdHVhbCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkZW50aWZpZXIgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkZW50aWZpZXJfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2FrLVwiXG4gICAgICArIGluc3RhbmNlX2NsYXNzICAgICAgICAgICAgICAgICAgICAgICAgPSBcImRiLnQzLm1pY3JvXCJcbiAgICAgICsgaW9wcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsga21zX2tleV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGF0ZXN0X3Jlc3RvcmFibGVfdGltZSAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGljZW5zZV9tb2RlbCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGlzdGVuZXJfZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFpbnRlbmFuY2Vfd2luZG93ICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlX21hc3Rlcl91c2VyX3Bhc3N3b3JkICAgICAgICAgICA9IHRydWVcbiAgICAgICsgbWFzdGVyX3VzZXJfc2VjcmV0ICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFzdGVyX3VzZXJfc2VjcmV0X2ttc19rZXlfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X2FsbG9jYXRlZF9zdG9yYWdlICAgICAgICAgICAgICAgICA9IDEwMFxuICAgICAgKyBtb25pdG9yaW5nX2ludGVydmFsICAgICAgICAgICAgICAgICAgID0gMFxuICAgICAgKyBtb25pdG9yaW5nX3JvbGVfYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtdWx0aV9heiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBuY2hhcl9jaGFyYWN0ZXJfc2V0X25hbWUgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuZXR3b3JrX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvcHRpb25fZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXJhbWV0ZXJfZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwZXJmb3JtYW5jZV9pbnNpZ2h0c19lbmFibGVkICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgcGVyZm9ybWFuY2VfaW5zaWdodHNfa21zX2tleV9pZCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVyZm9ybWFuY2VfaW5zaWdodHNfcmV0ZW50aW9uX3BlcmlvZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9ydCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHVibGljbHlfYWNjZXNzaWJsZSAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHJlcGxpY2FfbW9kZSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcGxpY2FzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlc291cmNlX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNraXBfZmluYWxfc25hcHNob3QgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBzbmFwc2hvdF9pZGVudGlmaWVyICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdG9yYWdlX3Rocm91Z2hwdXQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdG9yYWdlX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRpbWV6b25lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHVzZXJuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2FrX2RiYVwiXG4gICAgICArIHZwY19zZWN1cml0eV9ncm91cF9pZHMgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgYXdzX2RiX3N1Ym5ldF9ncm91cC5rZXljbG9hY2sgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3NfZGJfc3VibmV0X2dyb3VwLmtleWNsb2FjayBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19kYl9zdWJuZXRfZ3JvdXBcIiBcImtleWNsb2Fja1wiIHtcbiAgICAgIC0gYXJuICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6cmRzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c3ViZ3JwOmtleWNsb2FjazIwMjQwMzAzMTY1NjI0Mzk3MzAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgICA9IFwiTWFuYWdlZCBieSBUZXJyYWZvcm1cIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2syMDI0MDMwMzE2NTYyNDM5NzMwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2FjazIwMjQwMzAzMTY1NjI0Mzk3MzAwMDAwMDAxXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lX3ByZWZpeCAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrXCIgLT4gbnVsbFxuICAgICAgLSBzdWJuZXRfaWRzICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAtIFwic3VibmV0LTA2Y2FmNzFjOGIwYWZkOTA5XCIsXG4gICAgICAgICAgLSBcInN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM1wiLFxuICAgICAgICBdIC0+IG51bGxcbiAgICAgIC0gc3VwcG9ydGVkX25ldHdvcmtfdHlwZXMgPSBbXG4gICAgICAgICAgLSBcIklQVjRcIixcbiAgICAgICAgXSAtPiBudWxsXG4gICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgLSB0YWdzX2FsbCAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgIC0gXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfSAtPiBudWxsXG4gICAgICAtIHZwY19pZCAgICAgICAgICAgICAgICAgID0gXCJ2cGMtMDhlMTlkODU5YzI2ZDE4YjJcIiAtPiBudWxsXG4gICAgfVxuXG4gICMgYXdzX2RiX3N1Ym5ldF9ncm91cC5rZXljbG9hayB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19kYl9zdWJuZXRfZ3JvdXBcIiBcImtleWNsb2FrXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICAgPSBcIk1hbmFnZWQgYnkgVGVycmFmb3JtXCJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgICA9IFwia2V5Y2xvYWtcIlxuICAgICAgKyBzdWJuZXRfaWRzICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICArIFwic3VibmV0LTA2Y2FmNzFjOGIwYWZkOTA5XCIsXG4gICAgICAgICAgKyBcInN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM1wiLFxuICAgICAgICBdXG4gICAgICArIHN1cHBvcnRlZF9uZXR3b3JrX3R5cGVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB2cGNfaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleWNsb2Fja19zZXJ2aWNlIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXljbG9hY2tfc2VydmljZSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRcIiBcImtleWNsb2Fja19zZXJ2aWNlXCIge1xuICAgICAgLSBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6a2V5Y2xvYWNrX3NlcnZpY2UyMDI0MDMwMzE3MjMzMjE5ODQwMDAwMDAwMS1QNnJ2RDZcIiAtPiBudWxsXG4gICAgICAtIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICAgICA9IFwiQSBKU09OIHdpdGggdXNlcm5hbWUvcGFzc3dvcmQga2V5cyAtIE15U1FMIGFjY291bnQgdXNlZCBieSBrZXljbG9hY2sgc2VydmljZVwiIC0+IG51bGxcbiAgICAgIC0gZm9yY2Vfb3ZlcndyaXRlX3JlcGxpY2Ffc2VjcmV0ID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6a2V5Y2xvYWNrX3NlcnZpY2UyMDI0MDMwMzE3MjMzMjE5ODQwMDAwMDAwMS1QNnJ2RDZcIiAtPiBudWxsXG4gICAgICAtIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrX3NlcnZpY2UyMDI0MDMwMzE3MjMzMjE5ODQwMDAwMDAwMVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZV9wcmVmaXggICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2tfc2VydmljZVwiIC0+IG51bGxcbiAgICAgIC0gcmVjb3Zlcnlfd2luZG93X2luX2RheXMgICAgICAgID0gMCAtPiBudWxsXG4gICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgLSBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9IC0+IG51bGxcbiAgICB9XG5cbiAgIyBhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleWNsb2FrX3NlcnZpY2Ugd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0XCIgXCJrZXljbG9ha19zZXJ2aWNlXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICAgICA9IFwiQSBKU09OIHdpdGggdXNlcm5hbWUvcGFzc3dvcmQga2V5cyAtIE15U1FMIGFjY291bnQgdXNlZCBieSBrZXljbG9hayBzZXJ2aWNlXCJcbiAgICAgICsgZm9yY2Vfb3ZlcndyaXRlX3JlcGxpY2Ffc2VjcmV0ID0gZmFsc2VcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWtfc2VydmljZVwiXG4gICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVjb3Zlcnlfd2luZG93X2luX2RheXMgICAgICAgID0gMFxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ua2V5Y2xvYWNrX3NlcnZpY2Ugd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ua2V5Y2xvYWNrX3NlcnZpY2UgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb25cIiBcImtleWNsb2Fja19zZXJ2aWNlXCIge1xuICAgICAgLSBhcm4gICAgICAgICAgICA9IFwiYXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9hY2tfc2VydmljZTIwMjQwMzAzMTcyMzMyMTk4NDAwMDAwMDAxLVA2cnZENlwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgPSBcImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6a2V5Y2xvYWNrX3NlcnZpY2UyMDI0MDMwMzE3MjMzMjE5ODQwMDAwMDAwMS1QNnJ2RDZ8dGVycmFmb3JtLTIwMjQwMzAzMTcyMzMyNTg2MzAwMDAwMDAzXCIgLT4gbnVsbFxuICAgICAgLSBzZWNyZXRfaWQgICAgICA9IFwiYXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9hY2tfc2VydmljZTIwMjQwMzAzMTcyMzMyMTk4NDAwMDAwMDAxLVA2cnZENlwiIC0+IG51bGxcbiAgICAgIC0gc2VjcmV0X3N0cmluZyAgPSAoc2Vuc2l0aXZlIHZhbHVlKSAtPiBudWxsXG4gICAgICAtIHZlcnNpb25faWQgICAgID0gXCJ0ZXJyYWZvcm0tMjAyNDAzMDMxNzIzMzI1ODYzMDAwMDAwMDNcIiAtPiBudWxsXG4gICAgICAtIHZlcnNpb25fc3RhZ2VzID0gW1xuICAgICAgICAgIC0gXCJBV1NDVVJSRU5UXCIsXG4gICAgICAgIF0gLT4gbnVsbFxuICAgIH1cblxuICAjIGF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5rZXljbG9ha19zZXJ2aWNlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uXCIgXCJrZXljbG9ha19zZXJ2aWNlXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3JldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWNyZXRfc3RyaW5nICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIHZlcnNpb25faWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2ZXJzaW9uX3N0YWdlcyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBhd3Nfc2VjdXJpdHlfZ3JvdXAua2V5Y2xvYWNrIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX3NlY3VyaXR5X2dyb3VwLmtleWNsb2FjayBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19zZWN1cml0eV9ncm91cFwiIFwia2V5Y2xvYWNrXCIge1xuICAgICAgLSBhcm4gICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjMjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3VyaXR5LWdyb3VwL3NnLTA4MTA1YjQ4N2I0NTZjYWQ5XCIgLT4gbnVsbFxuICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJrZXljbG9hY2sgUkRTIGluc3RhbmNlXCIgLT4gbnVsbFxuICAgICAgLSBlZ3Jlc3MgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAtIGNpZHJfYmxvY2tzICAgICAgPSBbXG4gICAgICAgICAgICAgICAgICAtIFwiMC4wLjAuMC8wXCIsXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAtIGRlc2NyaXB0aW9uICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgIC0gZnJvbV9wb3J0ICAgICAgICA9IDBcbiAgICAgICAgICAgICAgLSBpcHY2X2NpZHJfYmxvY2tzID0gW11cbiAgICAgICAgICAgICAgLSBwcmVmaXhfbGlzdF9pZHMgID0gW11cbiAgICAgICAgICAgICAgLSBwcm90b2NvbCAgICAgICAgID0gXCItMVwiXG4gICAgICAgICAgICAgIC0gc2VjdXJpdHlfZ3JvdXBzICA9IFtdXG4gICAgICAgICAgICAgIC0gc2VsZiAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgIC0gdG9fcG9ydCAgICAgICAgICA9IDBcbiAgICAgICAgICAgIH0sXG4gICAgICAgIF0gLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgID0gXCJzZy0wODEwNWI0ODdiNDU2Y2FkOVwiIC0+IG51bGxcbiAgICAgIC0gaW5ncmVzcyAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBjaWRyX2Jsb2NrcyAgICAgID0gW1xuICAgICAgICAgICAgICAgICAgLSBcIjAuMC4wLjAvMFwiLFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgLSBkZXNjcmlwdGlvbiAgICAgID0gXCJBbGxvdyBhbGwgSUNNUCB0cmFmZmljXCJcbiAgICAgICAgICAgICAgLSBmcm9tX3BvcnQgICAgICAgID0gLTFcbiAgICAgICAgICAgICAgLSBpcHY2X2NpZHJfYmxvY2tzID0gW11cbiAgICAgICAgICAgICAgLSBwcmVmaXhfbGlzdF9pZHMgID0gW11cbiAgICAgICAgICAgICAgLSBwcm90b2NvbCAgICAgICAgID0gXCJpY21wXCJcbiAgICAgICAgICAgICAgLSBzZWN1cml0eV9ncm91cHMgID0gW11cbiAgICAgICAgICAgICAgLSBzZWxmICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgLSB0b19wb3J0ICAgICAgICAgID0gLTFcbiAgICAgICAgICAgIH0sXG4gICAgICAgICAgLSB7XG4gICAgICAgICAgICAgIC0gY2lkcl9ibG9ja3MgICAgICA9IFtcbiAgICAgICAgICAgICAgICAgIC0gXCIxMC4wLjAuMC8yMlwiLFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgLSBkZXNjcmlwdGlvbiAgICAgID0gXCJBbGxvdyBteXNxbCB0cmFmZmljXCJcbiAgICAgICAgICAgICAgLSBmcm9tX3BvcnQgICAgICAgID0gMzMwNlxuICAgICAgICAgICAgICAtIGlwdjZfY2lkcl9ibG9ja3MgPSBbXVxuICAgICAgICAgICAgICAtIHByZWZpeF9saXN0X2lkcyAgPSBbXVxuICAgICAgICAgICAgICAtIHByb3RvY29sICAgICAgICAgPSBcInRjcFwiXG4gICAgICAgICAgICAgIC0gc2VjdXJpdHlfZ3JvdXBzICA9IFtdXG4gICAgICAgICAgICAgIC0gc2VsZiAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgIC0gdG9fcG9ydCAgICAgICAgICA9IDMzMDZcbiAgICAgICAgICAgIH0sXG4gICAgICAgIF0gLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2stZGItMjAyNDAzMDMxNjU2MjQzOTczMDAwMDAwMDJcIiAtPiBudWxsXG4gICAgICAtIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImtleWNsb2Fjay1kYi1cIiAtPiBudWxsXG4gICAgICAtIG93bmVyX2lkICAgICAgICAgICAgICAgPSBcIjQ5MzM3MDgyNjQyNFwiIC0+IG51bGxcbiAgICAgIC0gcmV2b2tlX3J1bGVzX29uX2RlbGV0ZSA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiTmFtZVwiID0gXCJrZXljbG9hY2sgUkRTXCJcbiAgICAgICAgfSAtPiBudWxsXG4gICAgICAtIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcIk5hbWVcIiAgICAgICAgPSBcImtleWNsb2FjayBSRFNcIlxuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgLSBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9IC0+IG51bGxcbiAgICAgIC0gdnBjX2lkICAgICAgICAgICAgICAgICA9IFwidnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIGF3c19zZWN1cml0eV9ncm91cC5rZXljbG9hayB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zZWN1cml0eV9ncm91cFwiIFwia2V5Y2xvYWtcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcImtleWNsb2FrIFJEUyBpbnN0YW5jZVwiXG4gICAgICArIGVncmVzcyAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluZ3Jlc3MgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImtleWNsb2FrLWRiLVwiXG4gICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJldm9rZV9ydWxlc19vbl9kZWxldGUgPSBmYWxzZVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcImtleWNsb2FrIFJEU1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwia2V5Y2xvYWsgUkRTXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB2cGNfaWQgICAgICAgICAgICAgICAgID0gXCJ2cGMtMDhlMTlkODU5YzI2ZDE4YjJcIlxuICAgIH1cblxuICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUua2V5Y2xvYWNrX291dGdvaW5nIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5rZXljbG9hY2tfb3V0Z29pbmcgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlXCIgXCJrZXljbG9hY2tfb3V0Z29pbmdcIiB7XG4gICAgICAtIGFybiAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWMyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjdXJpdHktZ3JvdXAtcnVsZS9zZ3ItMDUzNTE1ZWQzOTY4OWM5ZWZcIiAtPiBudWxsXG4gICAgICAtIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICA9IFwic2dyLTA1MzUxNWVkMzk2ODljOWVmXCIgLT4gbnVsbFxuICAgICAgLSBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCItMVwiIC0+IG51bGxcbiAgICAgIC0gc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IFwic2ctMDgxMDViNDg3YjQ1NmNhZDlcIiAtPiBudWxsXG4gICAgICAtIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSBcInNnci0wNTM1MTVlZDM5Njg5YzllZlwiIC0+IG51bGxcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiTmFtZVwiID0gXCJvdXRnb2luZyB0cmFmZmljXCJcbiAgICAgICAgfSAtPiBudWxsXG4gICAgICAtIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcIk5hbWVcIiAgICAgICAgPSBcIm91dGdvaW5nIHRyYWZmaWNcIlxuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgLSBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9IC0+IG51bGxcbiAgICB9XG5cbiAgIyBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmtleWNsb2FrX291dGdvaW5nIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWtfb3V0Z29pbmdcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcIi0xXCJcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJvdXRnb2luZyB0cmFmZmljXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJvdXRnb2luZyB0cmFmZmljXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2Fjay1pY21wIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUua2V5Y2xvYWNrLWljbXAgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWNrLWljbXBcIiB7XG4gICAgICAtIGFybiAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWMyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjdXJpdHktZ3JvdXAtcnVsZS9zZ3ItMDQwYWEyNWIyMzAyZmM5ODNcIiAtPiBudWxsXG4gICAgICAtIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiIC0+IG51bGxcbiAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgYWxsIElDTVAgdHJhZmZpY1wiIC0+IG51bGxcbiAgICAgIC0gZnJvbV9wb3J0ICAgICAgICAgICAgICA9IC0xIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICA9IFwic2dyLTA0MGFhMjViMjMwMmZjOTgzXCIgLT4gbnVsbFxuICAgICAgLSBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJpY21wXCIgLT4gbnVsbFxuICAgICAgLSBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gXCJzZy0wODEwNWI0ODdiNDU2Y2FkOVwiIC0+IG51bGxcbiAgICAgIC0gc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IFwic2dyLTA0MGFhMjViMjMwMmZjOTgzXCIgLT4gbnVsbFxuICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJOYW1lXCIgPSBcIklDTVAgdHJhZmZpY1wiXG4gICAgICAgIH0gLT4gbnVsbFxuICAgICAgLSB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJOYW1lXCIgICAgICAgID0gXCJJQ01QIHRyYWZmaWNcIlxuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgLSBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9IC0+IG51bGxcbiAgICAgIC0gdG9fcG9ydCAgICAgICAgICAgICAgICA9IC0xIC0+IG51bGxcbiAgICB9XG5cbiAgIyBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5rZXljbG9hY2stbXlzcWwgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5rZXljbG9hY2stbXlzcWwgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWNrLW15c3FsXCIge1xuICAgICAgLSBhcm4gICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjMjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3VyaXR5LWdyb3VwLXJ1bGUvc2dyLTBjMDA3YWE2MjlkMDU3ZDVhXCIgLT4gbnVsbFxuICAgICAgLSBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIxMC4wLjAuMC8yMlwiIC0+IG51bGxcbiAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgbXlzcWwgdHJhZmZpY1wiIC0+IG51bGxcbiAgICAgIC0gZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDMzMDYgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgID0gXCJzZ3ItMGMwMDdhYTYyOWQwNTdkNWFcIiAtPiBudWxsXG4gICAgICAtIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcInRjcFwiIC0+IG51bGxcbiAgICAgIC0gc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IFwic2ctMDgxMDViNDg3YjQ1NmNhZDlcIiAtPiBudWxsXG4gICAgICAtIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSBcInNnci0wYzAwN2FhNjI5ZDA1N2Q1YVwiIC0+IG51bGxcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiTmFtZVwiID0gXCJteXNxbCBhY2Nlc3NcIlxuICAgICAgICB9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiTmFtZVwiICAgICAgICA9IFwibXlzcWwgYWNjZXNzXCJcbiAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgIC0gXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfSAtPiBudWxsXG4gICAgICAtIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAzMzA2IC0+IG51bGxcbiAgICB9XG5cbiAgIyBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5rZXljbG9hay1pY21wIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImtleWNsb2FrLWljbXBcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIkFsbG93IGFsbCBJQ01QIHRyYWZmaWNcIlxuICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gLTFcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiaWNtcFwiXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiA9IFwiSUNNUCB0cmFmZmljXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJQ01QIHRyYWZmaWNcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAtMVxuICAgIH1cblxuICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2FrLW15c3FsIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImtleWNsb2FrLW15c3FsXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIxMC4wLjAuMC8yMlwiXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIkFsbG93IG15c3FsIHRyYWZmaWNcIlxuICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gMzMwNlxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJ0Y3BcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcIm15c3FsIGFjY2Vzc1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwibXlzcWwgYWNjZXNzXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gMzMwNlxuICAgIH1cblxuICAjIHJhbmRvbV9wYXNzd29yZC5rZXljbG9hY2tfc2VydmljZSB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIHJhbmRvbV9wYXNzd29yZC5rZXljbG9hY2tfc2VydmljZSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcInJhbmRvbV9wYXNzd29yZFwiIFwia2V5Y2xvYWNrX3NlcnZpY2VcIiB7XG4gICAgICAtIGJjcnlwdF9oYXNoID0gKHNlbnNpdGl2ZSB2YWx1ZSkgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICA9IFwibm9uZVwiIC0+IG51bGxcbiAgICAgIC0gbGVuZ3RoICAgICAgPSAyMSAtPiBudWxsXG4gICAgICAtIGxvd2VyICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIG1pbl9sb3dlciAgID0gMCAtPiBudWxsXG4gICAgICAtIG1pbl9udW1lcmljID0gMCAtPiBudWxsXG4gICAgICAtIG1pbl9zcGVjaWFsID0gMCAtPiBudWxsXG4gICAgICAtIG1pbl91cHBlciAgID0gMCAtPiBudWxsXG4gICAgICAtIG51bWJlciAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIG51bWVyaWMgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIHJlc3VsdCAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSkgLT4gbnVsbFxuICAgICAgLSBzcGVjaWFsICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSB1cHBlciAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgIH1cblxuICAjIHJhbmRvbV9wYXNzd29yZC5rZXljbG9ha19zZXJ2aWNlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwicmFuZG9tX3Bhc3N3b3JkXCIgXCJrZXljbG9ha19zZXJ2aWNlXCIge1xuICAgICAgKyBiY3J5cHRfaGFzaCA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBsZW5ndGggICAgICA9IDIxXG4gICAgICArIGxvd2VyICAgICAgID0gdHJ1ZVxuICAgICAgKyBtaW5fbG93ZXIgICA9IDBcbiAgICAgICsgbWluX251bWVyaWMgPSAwXG4gICAgICArIG1pbl9zcGVjaWFsID0gMFxuICAgICAgKyBtaW5fdXBwZXIgICA9IDBcbiAgICAgICsgbnVtYmVyICAgICAgPSB0cnVlXG4gICAgICArIG51bWVyaWMgICAgID0gdHJ1ZVxuICAgICAgKyByZXN1bHQgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIHNwZWNpYWwgICAgID0gdHJ1ZVxuICAgICAgKyB1cHBlciAgICAgICA9IHRydWVcbiAgICB9XG5cbiAgIyBtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19zZXJ2aWNlLmVjcyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19lY3Nfc2VydmljZVwiIFwiZWNzXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlcnZpY2UvYXV0aC9hdXRoXCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXV0aFwiXG4gICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgfiB0YXNrX2RlZmluaXRpb24gICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhc2stZGVmaW5pdGlvbi9hdXRoOjdcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDEzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICg0IHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5rZXljbG9hay5hd3NfZWNzX3Rhc2tfZGVmaW5pdGlvbi5lY3MgbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiYXdzX2Vjc190YXNrX2RlZmluaXRpb25cIiBcImVjc1wiIHtcbiAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhc2stZGVmaW5pdGlvbi9hdXRoOjdcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGFybl93aXRob3V0X3JldmlzaW9uICAgICA9IFwiYXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXNrLWRlZmluaXRpb24vYXV0aFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gY29udGFpbmVyX2RlZmluaXRpb25zICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgID0gXCJhdXRoXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuZXR3b3JrX21vZGUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIHJlcXVpcmVzX2NvbXBhdGliaWxpdGllcyA9IFtdIC0+IG51bGxcbiAgICAgIH4gcmV2aXNpb24gICAgICAgICAgICAgICAgID0gNyAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgICAgIyAoNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG5QbGFuOiAxMCB0byBhZGQsIDEgdG8gY2hhbmdlLCAxMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZGluZy4uLiUwQWRhdGEudGVycmFmb3JtX3JlbW90ZV9zdGF0ZS5jaWNkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5lY3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5lY3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5lY3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyMTc3MjAzNzldJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5lY3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0NjY3NTc1MTddJTBBcmFuZG9tX3BldC5rZXljbG9ha19hZG1pbl91c2VybmFtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWNjZXB0ZWQtYXNwXSUwQXJhbmRvbV9wYXNzd29yZC5rZXljbG9hY2tfc2VydmljZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bm9uZV0lMEFyYW5kb21fcGFzc3dvcmQua2V5Y2xvYWtfYWRtaW5fcGFzc3dvcmQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBbW9kdWxlLmp1bXBob3N0LnJhbmRvbV9zdHJpbmcuYXNnX25hbWU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTAyUjdCWl0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLnJhbmRvbV9wYXNzd29yZC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ub25lXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0ucmFuZG9tX3Bhc3N3b3JkLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBbW9kdWxlLmp1bXBob3N0LnJhbmRvbV9zdHJpbmcucHJvZmlsZS1zdWZmaXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVp2MDFFbGhhamJCNl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NWRiNDk0ZGQtNTQ2Yi00MjMxLWEwYzctMTMzYjI0NWFkYTQ5XSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlX3BvbGljeTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfaWFtX3BvbGljeS5lY3MtdGFzay1leGVjdXRpb24tcm9sZS1wb2xpY3k6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1iMDRhZmY0NS00OGUxLTQ1MDEtOTBkMy05OThjOWZhMWYyNjRdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGVfcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMDc3ODA0NDc1XSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19jbHVzdGVyLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjbHVzdGVyL2F1dGhdJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfYW1pLmVjczogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2FtaS5lY3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2FtaS5lY3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wYzUzNWUyNGFiYmYxMjczOF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfaWFtX3BvbGljeS5lY3MtdGFzay1leGVjdXRpb24tcm9sZS1wb2xpY3k6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfYW1pLmVjczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTBjNTM1ZTI0YWJiZjEyNzM4XSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi4lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnJlZ2lzdHJ5X2NsaWVudF9zZWNyZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cmVnaXN0cnlfY2xpZW50X3NlY3JldDIwMjQwMzAyMjAzNzA4MDUxMDAwMDAwMDAxLVVBNHpSRV0lMEFhd3Nfa2V5X3BhaXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2Z1bmN0aW9uLmh0dHBfYXV0aDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cmVsZWFzZS1qYW1teV9pbmZyYWhvdXNlX2NvbS1hdXRoXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wNWM5NjkzNjk4ODBmYTJjMl0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19jbG91ZGZyb250X2Z1bmN0aW9uLmh0dHBfYXV0aDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cmVsZWFzZS1mb2NhbF9pbmZyYWhvdXNlX2NvbS1hdXRoXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbnN0YW5jZV9wb2xpY3k6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbnN0YW5jZV9wb2xpY3k6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1NTI5MTg4OTldJTBBbW9kdWxlLmluZnJhaG91c2UtdG9vbGtpdC1naXRodWIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFhd3Nfa2V5X3BhaXIuYWxla3MtQmxhY2stTUJQOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrcy1CbGFjay1NQlBdJTBBbW9kdWxlLmVjcy5hd3NfZWNzX2NsdXN0ZXIuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNsdXN0ZXIvdGVycmFmb3JtLXJlZ2lzdHJ5XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLXBhc3NwaHJhc2UtamFtbXkteGE2UFRHXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04MzczMTkwNF0lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcV0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5zdGFuY2VfcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmluc3RhbmNlX3BvbGljeTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU1MjkxODg5OV0lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleWNsb2FrX2FkbWluX2NyZWRzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OmtleWNsb2FrX2FkbWluX2NyZWRlbnRpYWxzMjAyNDAzMDIyMjQzNTIxNDI1MDAwMDAwMDEtcWtmY3hkXSUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wNWM5NjkzNjk4ODBmYTJjMl0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfY2xvdWRmcm9udF9vcmlnaW5fYWNjZXNzX2NvbnRyb2wucmVwby1zdG9yYWdlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1FMTlKVU9NNVdMOVIzUV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXQucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9nc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19jbG91ZGZyb250X29yaWdpbl9hY2Nlc3NfY29udHJvbC5yZXBvLXN0b3JhZ2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUVNWTRZUlFCWTlBNjRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0LnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsLWxvZ3NdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19lZnNfZmlsZV9zeXN0ZW0uaG9tZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZnMtMGNiZDM3NDk1NDhkMDRkYTZdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgzMTU0MDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3ZwYy52cGM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktamFtbXktWHJUV3JQXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1ODUzNDY4MzJdJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlX3BvbGljeTogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZV9wb2xpY3k6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEwNzc4MDQ0NzVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktZm9jYWwtWHJUV3JQXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZTIwMjQwMzAyMTk0OTM1MDY5ODAwMDAwMDA3XSUwQW1vZHVsZS5rZXljbG9hay5hd3NfaWFtX3JvbGUuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhUYXNrRXhlY3V0aW9uUm9sZV0lMEFkYXRhLmF3c19yb3V0ZTUzX3pvbmUuY2ljZC1paC1jb206IFJlYWRpbmcuLi4lMEFhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5rZXljbG9hY2stbXlzcWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYzAwN2FhNjI5ZDA1N2Q1YV0lMEFhd3NfZGJfc3VibmV0X2dyb3VwLmtleWNsb2FjazogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9a2V5Y2xvYWNrMjAyNDAzMDMxNjU2MjQzOTczMDAwMDAwMDFdJTBBYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5rZXljbG9hY2tfb3V0Z29pbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNTM1MTVlZDM5Njg5YzllZl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlZ2lzdHJ5X25vZGVfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlZ2lzdHJ5X25vZGVfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE4MDkwNjgwNDNdJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXljbG9hY2tfc2VydmljZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9hY2tfc2VydmljZTIwMjQwMzAzMTcyMzMyMTk4NDAwMDAwMDAxLVA2cnZENl0lMEFhd3NfZGJfaW5zdGFuY2Uua2V5Y2xvYWNrOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kYi1aUzdJVVdHT1BYQkI2UDdNNjNKM0xIUVE2RV0lMEFkYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQWF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2Fjay1pY21wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDQwYWEyNWIyMzAyZmM5ODNdJTBBZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ua2V5Y2xvYWNrX3NlcnZpY2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6a2V5Y2xvYWNrX3NlcnZpY2UyMDI0MDMwMzE3MjMzMjE5ODQwMDAwMDAwMS1QNnJ2RDZ8dGVycmFmb3JtLTIwMjQwMzAzMTcyMzMyNTg2MzAwMDAwMDAzXSUwQWF3c19zZWN1cml0eV9ncm91cC5rZXljbG9hY2s6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4MTA1YjQ4N2I0NTZjYWQ5XSUwQWRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5yZWdpc3RyeV9jbGllbnRfc2VjcmV0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yOTAzNTEzODBdJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucmVnaXN0cnlfY2xpZW50X3NlY3JldDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpyZWdpc3RyeV9jbGllbnRfc2VjcmV0MjAyNDAzMDIyMDM3MDgwNTEwMDAwMDAwMDEtVUE0elJFfEFXU0NVUlJFTlRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNDAyODUyZTEtNzA1NC00Y2VhLTgwYWMtM2NjYmVlNzJhMzk4XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy1lYXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzJlZWQ1M2QzLWUxYWQtNDc0My1hY2U1LTg5YzE5M2NkM2M2NV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhfaW5zdGFuY2UyMDI0MDMwMjIyMzYzNDg1MjAwMDAwMDAwMV0lMEFkYXRhLmF3c19yb3V0ZTUzX3pvbmUuY2ljZC1paC1jb206IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPVowNjc5MDA4Mk9VMFBPUFdPQ1BaNF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yl0lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjQyMzUyMDc5M10lMEFtb2R1bGUuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTA3OTE5MDkxXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5rZXljbG9ha19hZG1pbl9jcmVkczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9ha19hZG1pbl9jcmVkZW50aWFsczIwMjQwMzAyMjI0MzUyMTQyNTAwMDAwMDAxLXFrZmN4ZHx0ZXJyYWZvcm0tMjAyNDAzMDIyMjQzNTI3MjMzMDAwMDAwMDNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcXw2NTg2RUIxMy03OUMyLTQyNEQtQUZFRC02ODEwRTYxMTU2RDddJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR3xENkFCQ0IyQi1GODUwLTQ0ODctQTc2NC0wNzI2MzczNjMyM0VdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1adjAxRWxoYWpiQjYyMDI0MDIyMzAwNTExMjAzMjgwMDAwMDAwNV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5kaXN0cmlidXRpb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb25mL2Rpc3RyaWJ1dGlvbnNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yl0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3kuZWNzLXRhc2stZXhlY3V0aW9uLXJvbGUtcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQW1hem9uRUNTVGFza0V4ZWN1dGlvblJvbGVQb2xpY3ldJTBBbW9kdWxlLmVjcy5hd3NfaWFtX3JvbGUuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeVRhc2tFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9nc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsLWxvZ3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X2xvZ2dpbmcuc2VydmVyLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfbG9nZ2luZy5zZXJ2ZXItbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZV0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9ka2ltOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfZ29vZ2xlLl9kb21haW5rZXkuaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3kuZWNzLXRhc2stZXhlY3V0aW9uLXJvbGUtcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQW1hem9uRUNTVGFza0V4ZWN1dGlvblJvbGVQb2xpY3ldJTBBYXdzX2lhbV9wb2xpY3kucmVnaXN0cnlfbm9kZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvcmVnaXN0cnktbm9kZS0yMDI0MDMwMzA1MjEyNjA5MDMwMDAwMDAwMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wNzkwOTBlMDllZDVkYjU4Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cC5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wOGI5NjBiODVmNTk5NjEwMF0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlZ2lzdHJ5X25vZGVfYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZWdpc3RyeV9ub2RlX2Fzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzcxOTQ0OTc4Ml0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX2FtaS5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTBjNTM1ZTI0YWJiZjEyNzM4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA0YTE2ZTc0ZDViMTJhMzM4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBhYzFjMjMwOTFhNThiMGJkXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTAzMmM3NTU0MTkyMWJkOGYxXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX2FtaS5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTBjNTM1ZTI0YWJiZjEyNzM4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2N2MzMGU2NWRkNDEwOGU5XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDRiODg0NWQ4OTZjNmViZGVdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA2Y2FmNzFjOGIwYWZkOTA5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViXSUwQW1vZHVsZS5lY3MuZGF0YS5hd3Nfa2V5X3BhaXIuc3NoX2tleV9wYWlyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2tleV9wYWlyLnNzaF9rZXlfcGFpcjogUmVhZGluZy4uLiUwQW1vZHVsZS5wdXBwZXQtY29kZS1naXRodWIuYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtcHVwcGV0LWNvZGUtZ2l0aHViXSUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2UtdG9vbGtpdC1naXRodWJdJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19rZXlfcGFpci5zc2hfa2V5X3BhaXI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWtleS0wOWZlYmYyMTJhYzc0NjFhMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmluZnJhaG91c2UtY29tLWdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmluZnJhaG91c2UtY29tLWdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE3NTQyMTQxNjRdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0LVp2MDFFbGhhamJCNjIwMjQwMjIzMDA1MTEyMDIyODAwMDAwMDAyXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXV0aF9pbnN0YW5jZV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfYWNsLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbCxwcml2YXRlXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19rZXlfcGFpci5zc2hfa2V5X3BhaXI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWtleS0wOWZlYmYyMTJhYzc0NjFhMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfYWNsLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teSxwcml2YXRlXSUwQWF3c19yb3V0ZTUzX3JlY29yZC5jaS1jZC1uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2NpLWNkLmluZnJhaG91c2UuY29tX05TXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGVfcG9saWN5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoVGFza0V4ZWN1dGlvblJvbGUtMjAyNDAzMDIyMjM2MzUxODEwMDAwMDAwMDhdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1adjAxRWxoYWpiQjZdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIxMDgwMjg5NDk0XSUwQWF3c19pYW1fcm9sZS5yZWdpc3RyeS1ub2RlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwNzAwMDAwMDAyXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuZGVmYXVsdFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBlMWVlYTRjZTViNzk4MDQ2XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmRlZmF1bHRbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNjE0MDA1M2FiYzYyYTExOV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMGEzOTQ5YThhNWYwOTQxNzFdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAyYjQyZTcwZDUyYTVkYjdmXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9hdXRoX2luc3RhbmNlMjAyNDAzMDIyMjM2MzQ4NTM0MDAwMDAwMDNdJTBBbW9kdWxlLmVjcy5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGVfcG9saWN5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnlUYXNrRXhlY3V0aW9uUm9sZS0yMDI0MDMwMjE5NDkzNTg5NzcwMDAwMDAwOV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYWMxYzIzMDkxYTU4YjBiZDEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDRhMTZlNzRkNWIxMmEzMzgxMDgwMjg5NDk0XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvdGVycmFmb3JtLXJlZ2lzdHJ5X2luc3RhbmNlMjAyNDAzMDIxOTQ5MzUwNjcyMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD03MDk4NDEzOTFdJTBBYXdzX2lhbV9yb2xlLmluZnJhaG91c2UtY29tLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb20tZ2l0aHViXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfdXNlcmRhdGEuZGF0YS5jbG91ZGluaXRfY29uZmlnLmNvbmZpZzogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfdXNlcmRhdGEuZGF0YS5jbG91ZGluaXRfY29uZmlnLmNvbmZpZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTcwOTYxODc3MF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wMTUyMTUwMDU2MmZkMTdiMF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wMzQxOGY4ZWJhYzhhYTQwYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfcm91dGU1M196b25lLmp1bXBob3N0X3pvbmU6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJyZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzg3ZjJlYWQzYWJmNjgxMzRjNDk3YmY1MjcxOGUwN2IxLnJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInJlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fMDQ3YWUyOTkyNWVjMDI5N2VhZWJmZWRkYzg4NmYyMzQucmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfb2JqZWN0LmluZGV4LWh0bWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZGV4Lmh0bWxdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmluZGV4LWh0bWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZGV4Lmh0bWxdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRlYi1ncGctcHVibGljLWtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9REVCLUdQRy1LRVktcmVsZWFzZS1mb2NhbC5pbmZyYWhvdXNlLmNvbV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuZGViLWdwZy1wdWJsaWMta2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ERUItR1BHLUtFWS1yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtWnYwMUVsaGFqYkI2MjAyNDAyMjMwMDUxMTIwMzI4MDAwMDAwMDUtMjAyNDAyMjMwMDUxMTI2OTEyMDAwMDAwMDddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wZDRlMmVlOTY0NTJkODZmZV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnRhc2tfcm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cmVnaXN0cnktbm9kZS0yMDI0MDMwMzA1MjEyNjA5MDcwMDAwMDAwMi0yMDI0MDMwMzA1MjEyNjYwMTQwMDAwMDAwM10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhfaW5zdGFuY2UyMDI0MDMwMjIyMzYzNDg1MjAwMDAwMDAwMS0yMDI0MDMwMjIyMzYzNTIxMzgwMDAwMDAwOV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnlfaW5zdGFuY2UyMDI0MDMwMjE5NDkzNTA2OTgwMDAwMDAwNy0yMDI0MDMwMjE5NDkzNTg4NDYwMDAwMDAwOF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfc3VibmV0Lm5sYl9zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfc3VibmV0Lm5sYl9zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOTEwODAyODk0OTRdJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDMyYzc1NTQxOTIxYmQ4ZjExMDgwMjg5NDk0XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5hd3NfZWNzX3Rhc2tfZGVmaW5pdGlvbi5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wNy0yNCAxODo1MTozOS4wNTEgKzAwMDAgVVRDXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDctMjQgMTg6NTE6MzkuNDQyICswMDAwIFVUQ10lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfcm91dGU1M196b25lLmp1bXBob3N0X3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfdnBjLm5sYl9zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMF06IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTk4ODQ1MzE4XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMV06IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzFdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTY3MzE5Njc0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMl06IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzJdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTY2MDAzNzE0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMl06IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzJdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD02MjQ0MTkxMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblswXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NTcxNTEwMjIyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMV06IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzFdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjg2NzYxNjY1XSUwQW1vZHVsZS5lY3MuYXdzX3NlY3VyaXR5X2dyb3VwLmJhY2tlbmRfZXh0cmE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTBkZjk3ZTA0ZWVlMThjYzcyXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3NlY3VyaXR5X2dyb3VwLmVmczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDI5MDZiMzZjOWQxYmUxNTZdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zZWN1cml0eV9ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMGJjOGYyZmVkYTM2MjBmNmZdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3ZwYy5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5hd3Nfc2VjdXJpdHlfZ3JvdXAuYmFja2VuZF9leHRyYTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhjY2E4MmIyNTYyM2Q0ZWVdJTBBbW9kdWxlLmtleWNsb2FrLmF3c19lY3NfdGFza19kZWZpbml0aW9uLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXV0aF0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c192cGMuc2VydmljZTogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUud2Vic2VydmVyX3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3Nfc2VjdXJpdHlfZ3JvdXAuYWxiOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wNGE4NzYxYTc0ODI2YjRmOF0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3Nfc2VjdXJpdHlfZ3JvdXAuYmFja2VuZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDY1MzNlOTA2ZDc4NGIyYTVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjQwMzAyMjIzNjM0ODYxMzAwMDAwMDA2Lzc4MWVjZTkwYmRkZDhkNTldJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3ZwYy5zZXJ2aWNlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19zZWN1cml0eV9ncm91cC5iYWNrZW5kOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wNGI5MzYzODM0ZTEzYTIzZV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3NlY3VyaXR5X2dyb3VwLmFsYjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDQ4ZjIxZmEzNDk5ZDY5YWZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hbGJfdGFyZ2V0X2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXJnZXRncm91cC90Zi0yMDI0MDMwMjE5NDkzNTA2NzQwMDAwMDAwMi9jN2Y0MjdlMGUxZDIyOGZlXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yi0yMDIzMDgxODAzNDE1MDk5MzQwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcxNDI2MDM3Nl0lMEFtb2R1bGUuZWNzLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfZXh0cmFfdXNlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAyYjUyOTkzZDMyNTBkM2EwXSUwQW1vZHVsZS5lY3MuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9leHRyYV9yZXNlcnZlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAwMGVjZWJmNzUwZmMxYmYxXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5zc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wODIxNGQ5M2VlNzIxMmI2MF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfdnBjLnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYi5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9uZXQvanVtcGhvMjAyNDAyMjYxNzU0MDM4ODAyMDAwMDAwMDMvYjNmYzc0OWQ5OWUxYWVhNl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDlkZjNhOGVhMDg2ZjQxYzNdJTBBbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wMzM1OTUyZWE0YWMxNzQ2NV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhdW5jaF90ZW1wbGF0ZS5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bHQtMDAxNzQzZDFkMjI1N2M0MGJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuZWZzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGRiMThiYzYzZWU1NzY0NDVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfdnBjLnNlcnZpY2U6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Vmc19tb3VudF90YXJnZXQucGFja2FnZXNbXCJzdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWZzbXQtMGQwMjVjZmM5YzdlZTI4NTJdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3ZwYy5ubGJfc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Vmc19tb3VudF90YXJnZXQucGFja2FnZXNbXCJzdWJuZXQtMDZjYWY3MWM4YjBhZmQ5MDlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWZzbXQtMDU2NjhkMDZmZGE1Yjk2YjZdJTBBbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmVmc19pY21wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDUxNTIwNzFhYjJmN2I5ZTNdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS8zMmE3YjM5MS00Y2MzLTQ4ZmYtOGZjMS0zZjQ5OTRhOWIzNTFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3ZwYy5zZXJ2aWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViLTIwMjMwODE3MDEwODE4MjU4MjAwMDAwMDAxXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2V4dHJhX3VzZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZmIyNjFmZTNmMzU1OTdmMV0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9leHRyYV9yZXNlcnZlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA4NDM5ZDhjZTE3MjU1N2JhXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUxNjFRR0NQRTNKSU9LXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUxSUlMV0lZME9VNzhCXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmFsYl9pY21wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDViMGM0NjdkMGNjNjA4NGFdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2FjbV9jZXJ0aWZpY2F0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzgzMzI2OGZlLWNiOGUtNDYxMy05N2NiLTFmMTU0ODk1MmYxYV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYWxiLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL2F1dGgyMDI0MDMwMjIyMzYzNjc4OTAwMDAwMDAwYS9hMjY1NzhjZTQxYzgzMTBjXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmFsYl9saXN0ZW5lcl9wb3J0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGNjOTAyOTkwZmRlMDQxNTZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuaHR0cHM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wODA5MmFlOTgyNmMzOGVlOV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmFsYl9vdXRnb2luZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA4YzEyYTA0NWU4YmE5NzQ1XSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfc3NoX2lucHV0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGVjMGVlZDlmM2Q4YTNhYjddJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDg0YTRiNGE3OTU2Mjc1ZTZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9pY21wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGRhOTVkMzY4ZWMwYmNiZGJdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2xpc3RlbmVyX3BvcnQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYzU1MDFhYzk5Yzc3NzA3Nl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5hbGJfb3V0Z29pbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZmY4ODAxNjkxNWEwN2ZkYV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2FsYi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bG9hZGJhbGFuY2VyL2FwcC90ZXJyYWYyMDI0MDMwMjE5NDkzNjEyOTQwMDAwMDAwYS8xZjIwYjIyNWMzMjc4MjY2XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5odHRwczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBhMzJkNGNmNGZlOWZmNGFmXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5hbGJfaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBlMTBjNTUyM2IwMGY3YzIzXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2ljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNDNkMDJkZGZiOTc0NTk4MF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfaW5wdXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wN2E1ZGVhNWRiYjI5MWFhZV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wYjMzOGUwNTk0ZTczZTExYV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuZWZzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDExZTJmZWE2NmQ3NGI5OWZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfbG9jYWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYmJiNzkyMDJkZGUzZTgzZF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGRlMTIxMTRkODBhZjAyZGVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF91c2VyX3RyYWZmaWM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZDE2ODIxOGVmY2I3MjE5Yl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xiX3RhcmdldF9ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL2p1bXBobzIwMjQwMjI2MTc1NDAyOTAwMzAwMDAwMDAyL2U4MTliMzkxMzc0Zjg0N2VdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF91c2VyX3RyYWZmaWM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNmFlYzBlZjFkOTVhMTM3OF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfbG9jYWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wMDQ4OTNjN2UxY2Y0MjUwZl0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfbGF1bmNoX3RlbXBsYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTBkOTMxMzlhYjMyZGU0M2FhXSUwQW1vZHVsZS5qdW1waG9zdC5hd3Nfcm91dGU1M19yZWNvcmQuanVtcGhvc3RfY25hbWU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19qdW1waG9zdC5pbmZyYWhvdXNlLmNvbV9DTkFNRV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC9hdXRoMjAyNDAzMDIyMjM2MzY3ODkwMDAwMDAwMGEvYTI2NTc4Y2U0MWM4MzEwYy8zZjQ1MzYwMWQ2N2Q0MjFlXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19yb3V0ZTUzX3JlY29yZC5leHRyYVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2F1dGguaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInJlZ2lzdHJ5LmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2JlYzdkYWZkOGIwMDcxZDU2MzMyNzU0NDFmMzY5NzZlLnJlZ2lzdHJ5LmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wiYXV0aC5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX184OTZiM2MxZmRjNjlmOTUxZjIzY2JiODlkNzQ1NDllOC5hdXRoLmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWNsb3VkZnJvbnQtYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1jbG91ZGZyb250LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTMzMDg1MTE3XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtY2xvdWRmcm9udC1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWNsb3VkZnJvbnQtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODcyNTQ2NjQ0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZjIwMjQwMzAyMTk0OTM2NzQ1MjAwMDAwMDBkXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC90ZXJyYWYyMDI0MDMwMjE5NDkzNjEyOTQwMDAwMDAwYS8xZjIwYjIyNWMzMjc4MjY2LzljNDE5ZTRhMTY5ZDYxZTFdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19yb3V0ZTUzX3JlY29yZC5leHRyYVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlZ2lzdHJ5LmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjkyOTQzNDEwOV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MjA5MTMwNjE5XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGJfbGlzdGVuZXIuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9uZXQvanVtcGhvMjAyNDAyMjYxNzU0MDM4ODAyMDAwMDAwMDMvYjNmYzc0OWQ5OWUxYWVhNi85MWFjYTlkNTAzY2U2NGNjXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoMjAyNDAzMDIyMjM2Mzc4NDk2MDAwMDAwMGRdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtMjAyNDAyMjMwMDUxMTMzNTkxMDAwMDAwMDktMDJSN0JaXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4tMjAyMzA4MTgwMzQxNTg5ODUxMDAwMDAwMDJdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19wb2xpY3kuY3B1X2xvYWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZjIwMjQwMzAyMTk0OTM2NzQ1MjAwMDAwMDBkXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kuYnVja2V0LWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kuYnVja2V0LWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0yMDI0LTAzLTAyIDIyOjM2OjUxLjA4NyArMDAwMCBVVENdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0yMDI0LTAzLTAyIDE5OjQ5OjUzLjA2MyArMDAwMCBVVENdJTBBbW9kdWxlLmVjcy5hd3NfZWNzX2NhcGFjaXR5X3Byb3ZpZGVyLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjYXBhY2l0eS1wcm92aWRlci90ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYXV0b3NjYWxpbmdfcG9saWN5LmNwdV9sb2FkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoMjAyNDAzMDIyMjM2Mzc4NDk2MDAwMDAwMGRdJTBBbW9kdWxlLmtleWNsb2FrLmF3c19lY3NfY2FwYWNpdHlfcHJvdmlkZXIuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNhcGFjaXR5LXByb3ZpZGVyL2F1dGhdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wYWNrYWdlLXB1Ymxpc2hlcjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwNTAwMDYwMzddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucmVxdWlyZWRfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZXF1aXJlZF9wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDg1NDg3MzE0XSUwQWF3c19pYW1fcG9saWN5LnBhY2thZ2UtcHVibGlzaGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9wYWNrYWdlLXB1Ymxpc2hlcl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kucmVxdWlyZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3RlcnJhZm9ybS0yMDI0MDIyMzAwNTE0NTkyOTgwMDAwMDAxNF0lMEFtb2R1bGUuZWNzLmF3c19lY3NfY2x1c3Rlcl9jYXBhY2l0eV9wcm92aWRlcnMuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmVjcy5hd3NfZWNzX3NlcnZpY2UuZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlcnZpY2UvdGVycmFmb3JtLXJlZ2lzdHJ5L3RlcnJhZm9ybS1yZWdpc3RyeV0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19zZXJ2aWNlLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZXJ2aWNlL2F1dGgvYXV0aF0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19jbHVzdGVyX2NhcGFjaXR5X3Byb3ZpZGVycy5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2xiX2xpc3RlbmVyLnNzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC9hdXRoMjAyNDAzMDIyMjM2MzY3ODkwMDAwMDAwMGEvYTI2NTc4Y2U0MWM4MzEwYy85N2I1ZmZlNGM5ZTAwN2RmXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfbGJfbGlzdGVuZXIuc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3RlcnJhZjIwMjQwMzAyMTk0OTM2MTI5NDAwMDAwMDBhLzFmMjBiMjI1YzMyNzgyNjYvM2ExMTljOTlkOWY3NGVhZF0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2FwcGF1dG9zY2FsaW5nX3RhcmdldC5lY3NfdGFyZ2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlL2F1dGgvYXV0aF0lMEFtb2R1bGUuZWNzLmF3c19hcHBhdXRvc2NhbGluZ190YXJnZXQuZWNzX3RhcmdldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS90ZXJyYWZvcm0tcmVnaXN0cnkvdGVycmFmb3JtLXJlZ2lzdHJ5XSUwQW1vZHVsZS5rZXljbG9hay5hd3NfYXBwYXV0b3NjYWxpbmdfcG9saWN5LmVjc19wb2xpY3k6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNwdS1hdXRvLXNjYWxpbmddJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi0yMDIzMTEwODEzMzIwMDE3NTQwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaW5mcmFob3VzZS1jb20tZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbS1naXRodWItMjAyMzA4MTkyMTQxMzk3NTYzMDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnB1cHBldC1jb2RlLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtcHVwcGV0LWNvZGUtZ2l0aHViLTIwMjMxMTA4MTMyMjQ4NTgzMTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLTIwMjQwMjI5MjA1MDE5NDY3NjAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZXh0cmFbXCJyZXF1aXJlZFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtWnYwMUVsaGFqYkI2MjAyNDAyMjMwMDUxMTIwMzI4MDAwMDAwMDUtMjAyNDAyMjMwMDUxNDYzMjUzMDAwMDAwMTZdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5leHRyYVtcInBhY2thZ2UtcHVibGlzaGVyXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1adjAxRWxoYWpiQjYyMDI0MDIyMzAwNTExMjAzMjgwMDAwMDAwNS0yMDI0MDIyMzAwNTE0NjMyMDEwMDAwMDAxNV0lMEFtb2R1bGUuZWNzLmF3c19hcHBhdXRvc2NhbGluZ19wb2xpY3kuZWNzX3BvbGljeTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y3B1LWF1dG8tc2NhbGluZ10lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBICAtIGRlc3Ryb3klMEEtLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnQlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgYXdzX2RiX2luc3RhbmNlLmtleWNsb2FjayB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3NfZGJfaW5zdGFuY2Uua2V5Y2xvYWNrIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19kYl9pbnN0YW5jZVwiIFwia2V5Y2xvYWNrXCIgeyUwQSAgICAgIC0gYWRkcmVzcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrLTIwMjQwMzAzMTY1NjI2Mjg4NjAwMDAwMDAzLmMydXplYjhlbmJ5Yi51cy13ZXN0LTEucmRzLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsJTBBICAgICAgLSBhbGxvY2F0ZWRfc3RvcmFnZSAgICAgICAgICAgICAgICAgICAgID0gMTAgLT4gbnVsbCUwQSAgICAgIC0gYXBwbHlfaW1tZWRpYXRlbHkgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAtIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6cmRzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6ZGI6a2V5Y2xvYWNrLTIwMjQwMzAzMTY1NjI2Mjg4NjAwMDAwMDAzXCIgLT4gbnVsbCUwQSAgICAgIC0gYXV0b19taW5vcl92ZXJzaW9uX3VwZ3JhZGUgICAgICAgICAgICA9IHRydWUgLT4gbnVsbCUwQSAgICAgIC0gYXZhaWxhYmlsaXR5X3pvbmUgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xY1wiIC0+IG51bGwlMEEgICAgICAtIGJhY2t1cF9yZXRlbnRpb25fcGVyaW9kICAgICAgICAgICAgICAgPSA3IC0+IG51bGwlMEEgICAgICAtIGJhY2t1cF90YXJnZXQgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInJlZ2lvblwiIC0+IG51bGwlMEEgICAgICAtIGJhY2t1cF93aW5kb3cgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjEyOjQ1LTEzOjE1XCIgLT4gbnVsbCUwQSAgICAgIC0gY2FfY2VydF9pZGVudGlmaWVyICAgICAgICAgICAgICAgICAgICA9IFwicmRzLWNhLXJzYTIwNDgtZzFcIiAtPiBudWxsJTBBICAgICAgLSBjb3B5X3RhZ3NfdG9fc25hcHNob3QgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgIC0gY3VzdG9tZXJfb3duZWRfaXBfZW5hYmxlZCAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAtIGRiX25hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2Fja1wiIC0+IG51bGwlMEEgICAgICAtIGRiX3N1Ym5ldF9ncm91cF9uYW1lICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2FjazIwMjQwMzAzMTY1NjI0Mzk3MzAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gZGVsZXRlX2F1dG9tYXRlZF9iYWNrdXBzICAgICAgICAgICAgICA9IHRydWUgLT4gbnVsbCUwQSAgICAgIC0gZGVsZXRpb25fcHJvdGVjdGlvbiAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAtIGRvbWFpbl9kbnNfaXBzICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsJTBBICAgICAgLSBlbmFibGVkX2Nsb3Vkd2F0Y2hfbG9nc19leHBvcnRzICAgICAgID0gW10gLT4gbnVsbCUwQSAgICAgIC0gZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrLTIwMjQwMzAzMTY1NjI2Mjg4NjAwMDAwMDAzLmMydXplYjhlbmJ5Yi51cy13ZXN0LTEucmRzLmFtYXpvbmF3cy5jb206MzMwNlwiIC0+IG51bGwlMEEgICAgICAtIGVuZ2luZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIm15c3FsXCIgLT4gbnVsbCUwQSAgICAgIC0gZW5naW5lX3ZlcnNpb24gICAgICAgICAgICAgICAgICAgICAgICA9IFwiOC4wXCIgLT4gbnVsbCUwQSAgICAgIC0gZW5naW5lX3ZlcnNpb25fYWN0dWFsICAgICAgICAgICAgICAgICA9IFwiOC4wLjM1XCIgLT4gbnVsbCUwQSAgICAgIC0gaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjEwV0k5MVM1OVhYUU5cIiAtPiBudWxsJTBBICAgICAgLSBpYW1fZGF0YWJhc2VfYXV0aGVudGljYXRpb25fZW5hYmxlZCAgID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZGItWlM3SVVXR09QWEJCNlA3TTYzSjNMSFFRNkVcIiAtPiBudWxsJTBBICAgICAgLSBpZGVudGlmaWVyICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2stMjAyNDAzMDMxNjU2MjYyODg2MDAwMDAwMDNcIiAtPiBudWxsJTBBICAgICAgLSBpZGVudGlmaWVyX3ByZWZpeCAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2stXCIgLT4gbnVsbCUwQSAgICAgIC0gaW5zdGFuY2VfY2xhc3MgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZGIudDMubWljcm9cIiAtPiBudWxsJTBBICAgICAgLSBpb3BzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gMCAtPiBudWxsJTBBICAgICAgLSBsYXRlc3RfcmVzdG9yYWJsZV90aW1lICAgICAgICAgICAgICAgID0gXCIyMDI0LTAzLTAzVDE3OjM1OjAwWlwiIC0+IG51bGwlMEEgICAgICAtIGxpY2Vuc2VfbW9kZWwgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdlbmVyYWwtcHVibGljLWxpY2Vuc2VcIiAtPiBudWxsJTBBICAgICAgLSBsaXN0ZW5lcl9lbmRwb2ludCAgICAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbCUwQSAgICAgIC0gbWFpbnRlbmFuY2Vfd2luZG93ICAgICAgICAgICAgICAgICAgICA9IFwidHVlOjEyOjA3LXR1ZToxMjozN1wiIC0+IG51bGwlMEEgICAgICAtIG1hbmFnZV9tYXN0ZXJfdXNlcl9wYXNzd29yZCAgICAgICAgICAgPSB0cnVlIC0+IG51bGwlMEEgICAgICAtIG1hc3Rlcl91c2VyX3NlY3JldCAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgLSBrbXNfa2V5X2lkICAgID0gXCJhcm46YXdzOmttczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmtleS80ZjMyYmUzMS1lYTcyLTQwNDYtYmFmYS1lYTBhNjFhNThjZWVcIiUwQSAgICAgICAgICAgICAgLSBzZWNyZXRfYXJuICAgID0gXCJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnJkcyFkYi00M2EwMTNkYS1mOWUyLTRlNzktYTIyMy1mMzQ3M2FiMjgyNGQtUXplZWhuXCIlMEEgICAgICAgICAgICAgIC0gc2VjcmV0X3N0YXR1cyA9IFwiYWN0aXZlXCIlMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgXSAtPiBudWxsJTBBICAgICAgLSBtYXhfYWxsb2NhdGVkX3N0b3JhZ2UgICAgICAgICAgICAgICAgID0gMTAwIC0+IG51bGwlMEEgICAgICAtIG1vbml0b3JpbmdfaW50ZXJ2YWwgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGwlMEEgICAgICAtIG11bHRpX2F6ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB0cnVlIC0+IG51bGwlMEEgICAgICAtIG5ldHdvcmtfdHlwZSAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIklQVjRcIiAtPiBudWxsJTBBICAgICAgLSBvcHRpb25fZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgICAgID0gXCJkZWZhdWx0Om15c3FsLTgtMFwiIC0+IG51bGwlMEEgICAgICAtIHBhcmFtZXRlcl9ncm91cF9uYW1lICAgICAgICAgICAgICAgICAgPSBcImRlZmF1bHQubXlzcWw4LjBcIiAtPiBudWxsJTBBICAgICAgLSBwZXJmb3JtYW5jZV9pbnNpZ2h0c19lbmFibGVkICAgICAgICAgID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgIC0gcGVyZm9ybWFuY2VfaW5zaWdodHNfcmV0ZW50aW9uX3BlcmlvZCA9IDAgLT4gbnVsbCUwQSAgICAgIC0gcG9ydCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IDMzMDYgLT4gbnVsbCUwQSAgICAgIC0gcHVibGljbHlfYWNjZXNzaWJsZSAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAtIHJlcGxpY2FzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsJTBBICAgICAgLSByZXNvdXJjZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJkYi1aUzdJVVdHT1BYQkI2UDdNNjNKM0xIUVE2RVwiIC0+IG51bGwlMEEgICAgICAtIHNraXBfZmluYWxfc25hcHNob3QgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgLSBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhdmFpbGFibGVcIiAtPiBudWxsJTBBICAgICAgLSBzdG9yYWdlX2VuY3J5cHRlZCAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgIC0gc3RvcmFnZV90aHJvdWdocHV0ICAgICAgICAgICAgICAgICAgICA9IDAgLT4gbnVsbCUwQSAgICAgIC0gc3RvcmFnZV90eXBlICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZ3AyXCIgLT4gbnVsbCUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICAtIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgIC0gXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICAgIC0gdXNlcm5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrX2RiYVwiIC0+IG51bGwlMEEgICAgICAtIHZwY19zZWN1cml0eV9ncm91cF9pZHMgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgIC0gXCJzZy0wODEwNWI0ODdiNDU2Y2FkOVwiLCUwQSAgICAgICAgXSAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgYXdzX2RiX2luc3RhbmNlLmtleWNsb2FrIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19kYl9pbnN0YW5jZVwiIFwia2V5Y2xvYWtcIiB7JTBBICAgICAgKyBhZGRyZXNzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYWxsb2NhdGVkX3N0b3JhZ2UgICAgICAgICAgICAgICAgICAgICA9IDEwJTBBICAgICAgKyBhcHBseV9pbW1lZGlhdGVseSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhdXRvX21pbm9yX3ZlcnNpb25fdXBncmFkZSAgICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJhY2t1cF9yZXRlbnRpb25fcGVyaW9kICAgICAgICAgICAgICAgPSA3JTBBICAgICAgKyBiYWNrdXBfdGFyZ2V0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYmFja3VwX3dpbmRvdyAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNhX2NlcnRfaWRlbnRpZmllciAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaGFyYWN0ZXJfc2V0X25hbWUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY29weV90YWdzX3RvX3NuYXBzaG90ICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBkYl9uYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9ha1wiJTBBICAgICAgKyBkYl9zdWJuZXRfZ3JvdXBfbmFtZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVsZXRlX2F1dG9tYXRlZF9iYWNrdXBzICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIGRlbGV0aW9uX3Byb3RlY3Rpb24gICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBkb21haW5fZnFkbiAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGVuZ2luZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIm15c3FsXCIlMEEgICAgICArIGVuZ2luZV92ZXJzaW9uICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjguMFwiJTBBICAgICAgKyBlbmdpbmVfdmVyc2lvbl9hY3R1YWwgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZGVudGlmaWVyICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWRlbnRpZmllcl9wcmVmaXggICAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWstXCIlMEEgICAgICArIGluc3RhbmNlX2NsYXNzICAgICAgICAgICAgICAgICAgICAgICAgPSBcImRiLnQzLm1pY3JvXCIlMEEgICAgICArIGlvcHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBrbXNfa2V5X2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbGF0ZXN0X3Jlc3RvcmFibGVfdGltZSAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGxpY2Vuc2VfbW9kZWwgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsaXN0ZW5lcl9lbmRwb2ludCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFpbnRlbmFuY2Vfd2luZG93ICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1hbmFnZV9tYXN0ZXJfdXNlcl9wYXNzd29yZCAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBtYXN0ZXJfdXNlcl9zZWNyZXQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFzdGVyX3VzZXJfc2VjcmV0X2ttc19rZXlfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1heF9hbGxvY2F0ZWRfc3RvcmFnZSAgICAgICAgICAgICAgICAgPSAxMDAlMEEgICAgICArIG1vbml0b3JpbmdfaW50ZXJ2YWwgICAgICAgICAgICAgICAgICAgPSAwJTBBICAgICAgKyBtb25pdG9yaW5nX3JvbGVfYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbXVsdGlfYXogICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIG5jaGFyX2NoYXJhY3Rlcl9zZXRfbmFtZSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuZXR3b3JrX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3B0aW9uX2dyb3VwX25hbWUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhcmFtZXRlcl9ncm91cF9uYW1lICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJmb3JtYW5jZV9pbnNpZ2h0c19lbmFibGVkICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIHBlcmZvcm1hbmNlX2luc2lnaHRzX2ttc19rZXlfaWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJmb3JtYW5jZV9pbnNpZ2h0c19yZXRlbnRpb25fcGVyaW9kID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9ydCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHB1YmxpY2x5X2FjY2Vzc2libGUgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgcmVwbGljYV9tb2RlICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcGxpY2FzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXNvdXJjZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2tpcF9maW5hbF9zbmFwc2hvdCAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBzbmFwc2hvdF9pZGVudGlmaWVyICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0b3JhZ2VfdGhyb3VnaHB1dCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdG9yYWdlX3R5cGUgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGltZXpvbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVzZXJuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2FrX2RiYVwiJTBBICAgICAgKyB2cGNfc2VjdXJpdHlfZ3JvdXBfaWRzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIGF3c19kYl9zdWJuZXRfZ3JvdXAua2V5Y2xvYWNrIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c19kYl9zdWJuZXRfZ3JvdXAua2V5Y2xvYWNrIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19kYl9zdWJuZXRfZ3JvdXBcIiBcImtleWNsb2Fja1wiIHslMEEgICAgICAtIGFybiAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOnJkczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnN1YmdycDprZXljbG9hY2syMDI0MDMwMzE2NTYyNDM5NzMwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIGRlc2NyaXB0aW9uICAgICAgICAgICAgID0gXCJNYW5hZ2VkIGJ5IFRlcnJhZm9ybVwiIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2syMDI0MDMwMzE2NTYyNDM5NzMwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIG5hbWUgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2syMDI0MDMwMzE2NTYyNDM5NzMwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIG5hbWVfcHJlZml4ICAgICAgICAgICAgID0gXCJrZXljbG9hY2tcIiAtPiBudWxsJTBBICAgICAgLSBzdWJuZXRfaWRzICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgLSBcInN1Ym5ldC0wNmNhZjcxYzhiMGFmZDkwOVwiLCUwQSAgICAgICAgICAtIFwic3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXCIsJTBBICAgICAgICBdIC0+IG51bGwlMEEgICAgICAtIHN1cHBvcnRlZF9uZXR3b3JrX3R5cGVzID0gWyUwQSAgICAgICAgICAtIFwiSVBWNFwiLCUwQSAgICAgICAgXSAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICAtIHRhZ3NfYWxsICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAtIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgICAtIHZwY19pZCAgICAgICAgICAgICAgICAgID0gXCJ2cGMtMDhlMTlkODU5YzI2ZDE4YjJcIiAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgYXdzX2RiX3N1Ym5ldF9ncm91cC5rZXljbG9hayB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZGJfc3VibmV0X2dyb3VwXCIgXCJrZXljbG9ha1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICAgPSBcIk1hbmFnZWQgYnkgVGVycmFmb3JtXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgICA9IFwia2V5Y2xvYWtcIiUwQSAgICAgICsgc3VibmV0X2lkcyAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICsgXCJzdWJuZXQtMDZjYWY3MWM4YjBhZmQ5MDlcIiwlMEEgICAgICAgICAgKyBcInN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM1wiLCUwQSAgICAgICAgXSUwQSAgICAgICsgc3VwcG9ydGVkX25ldHdvcmtfdHlwZXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXljbG9hY2tfc2VydmljZSB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleWNsb2Fja19zZXJ2aWNlIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRcIiBcImtleWNsb2Fja19zZXJ2aWNlXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OmtleWNsb2Fja19zZXJ2aWNlMjAyNDAzMDMxNzIzMzIxOTg0MDAwMDAwMDEtUDZydkQ2XCIgLT4gbnVsbCUwQSAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgICAgID0gXCJBIEpTT04gd2l0aCB1c2VybmFtZS9wYXNzd29yZCBrZXlzIC0gTXlTUUwgYWNjb3VudCB1c2VkIGJ5IGtleWNsb2FjayBzZXJ2aWNlXCIgLT4gbnVsbCUwQSAgICAgIC0gZm9yY2Vfb3ZlcndyaXRlX3JlcGxpY2Ffc2VjcmV0ID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OmtleWNsb2Fja19zZXJ2aWNlMjAyNDAzMDMxNzIzMzIxOTg0MDAwMDAwMDEtUDZydkQ2XCIgLT4gbnVsbCUwQSAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2tfc2VydmljZTIwMjQwMzAzMTcyMzMyMTk4NDAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gbmFtZV9wcmVmaXggICAgICAgICAgICAgICAgICAgID0gXCJrZXljbG9hY2tfc2VydmljZVwiIC0+IG51bGwlMEEgICAgICAtIHJlY292ZXJ5X3dpbmRvd19pbl9kYXlzICAgICAgICA9IDAgLT4gbnVsbCUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAtIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleWNsb2FrX3NlcnZpY2Ugd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldFwiIFwia2V5Y2xvYWtfc2VydmljZVwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICAgICA9IFwiQSBKU09OIHdpdGggdXNlcm5hbWUvcGFzc3dvcmQga2V5cyAtIE15U1FMIGFjY291bnQgdXNlZCBieSBrZXljbG9hayBzZXJ2aWNlXCIlMEEgICAgICArIGZvcmNlX292ZXJ3cml0ZV9yZXBsaWNhX3NlY3JldCA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgICAgICAgICAgPSBcImtleWNsb2FrX3NlcnZpY2VcIiUwQSAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVjb3Zlcnlfd2luZG93X2luX2RheXMgICAgICAgID0gMCUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmtleWNsb2Fja19zZXJ2aWNlIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5rZXljbG9hY2tfc2VydmljZSBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb25cIiBcImtleWNsb2Fja19zZXJ2aWNlXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgICAgPSBcImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6a2V5Y2xvYWNrX3NlcnZpY2UyMDI0MDMwMzE3MjMzMjE5ODQwMDAwMDAwMS1QNnJ2RDZcIiAtPiBudWxsJTBBICAgICAgLSBpZCAgICAgICAgICAgICA9IFwiYXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9hY2tfc2VydmljZTIwMjQwMzAzMTcyMzMyMTk4NDAwMDAwMDAxLVA2cnZENnx0ZXJyYWZvcm0tMjAyNDAzMDMxNzIzMzI1ODYzMDAwMDAwMDNcIiAtPiBudWxsJTBBICAgICAgLSBzZWNyZXRfaWQgICAgICA9IFwiYXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9hY2tfc2VydmljZTIwMjQwMzAzMTcyMzMyMTk4NDAwMDAwMDAxLVA2cnZENlwiIC0+IG51bGwlMEEgICAgICAtIHNlY3JldF9zdHJpbmcgID0gKHNlbnNpdGl2ZSB2YWx1ZSkgLT4gbnVsbCUwQSAgICAgIC0gdmVyc2lvbl9pZCAgICAgPSBcInRlcnJhZm9ybS0yMDI0MDMwMzE3MjMzMjU4NjMwMDAwMDAwM1wiIC0+IG51bGwlMEEgICAgICAtIHZlcnNpb25fc3RhZ2VzID0gWyUwQSAgICAgICAgICAtIFwiQVdTQ1VSUkVOVFwiLCUwQSAgICAgICAgXSAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmtleWNsb2FrX3NlcnZpY2Ugd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uXCIgXCJrZXljbG9ha19zZXJ2aWNlXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3JldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjcmV0X3N0cmluZyAgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgICsgdmVyc2lvbl9pZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB2ZXJzaW9uX3N0YWdlcyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBhd3Nfc2VjdXJpdHlfZ3JvdXAua2V5Y2xvYWNrIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c19zZWN1cml0eV9ncm91cC5rZXljbG9hY2sgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX3NlY3VyaXR5X2dyb3VwXCIgXCJrZXljbG9hY2tcIiB7JTBBICAgICAgLSBhcm4gICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjMjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3VyaXR5LWdyb3VwL3NnLTA4MTA1YjQ4N2I0NTZjYWQ5XCIgLT4gbnVsbCUwQSAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwia2V5Y2xvYWNrIFJEUyBpbnN0YW5jZVwiIC0+IG51bGwlMEEgICAgICAtIGVncmVzcyAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgLSBjaWRyX2Jsb2NrcyAgICAgID0gWyUwQSAgICAgICAgICAgICAgICAgIC0gXCIwLjAuMC4wLzBcIiwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgLSBkZXNjcmlwdGlvbiAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgLSBmcm9tX3BvcnQgICAgICAgID0gMCUwQSAgICAgICAgICAgICAgLSBpcHY2X2NpZHJfYmxvY2tzID0gW10lMEEgICAgICAgICAgICAgIC0gcHJlZml4X2xpc3RfaWRzICA9IFtdJTBBICAgICAgICAgICAgICAtIHByb3RvY29sICAgICAgICAgPSBcIi0xXCIlMEEgICAgICAgICAgICAgIC0gc2VjdXJpdHlfZ3JvdXBzICA9IFtdJTBBICAgICAgICAgICAgICAtIHNlbGYgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgLSB0b19wb3J0ICAgICAgICAgID0gMCUwQSAgICAgICAgICAgIH0sJTBBICAgICAgICBdIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgPSBcInNnLTA4MTA1YjQ4N2I0NTZjYWQ5XCIgLT4gbnVsbCUwQSAgICAgIC0gaW5ncmVzcyAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAtIGNpZHJfYmxvY2tzICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgLSBcIjAuMC4wLjAvMFwiLCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAtIGRlc2NyaXB0aW9uICAgICAgPSBcIkFsbG93IGFsbCBJQ01QIHRyYWZmaWNcIiUwQSAgICAgICAgICAgICAgLSBmcm9tX3BvcnQgICAgICAgID0gLTElMEEgICAgICAgICAgICAgIC0gaXB2Nl9jaWRyX2Jsb2NrcyA9IFtdJTBBICAgICAgICAgICAgICAtIHByZWZpeF9saXN0X2lkcyAgPSBbXSUwQSAgICAgICAgICAgICAgLSBwcm90b2NvbCAgICAgICAgID0gXCJpY21wXCIlMEEgICAgICAgICAgICAgIC0gc2VjdXJpdHlfZ3JvdXBzICA9IFtdJTBBICAgICAgICAgICAgICAtIHNlbGYgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgLSB0b19wb3J0ICAgICAgICAgID0gLTElMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgIC0gY2lkcl9ibG9ja3MgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICAtIFwiMTAuMC4wLjAvMjJcIiwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgLSBkZXNjcmlwdGlvbiAgICAgID0gXCJBbGxvdyBteXNxbCB0cmFmZmljXCIlMEEgICAgICAgICAgICAgIC0gZnJvbV9wb3J0ICAgICAgICA9IDMzMDYlMEEgICAgICAgICAgICAgIC0gaXB2Nl9jaWRyX2Jsb2NrcyA9IFtdJTBBICAgICAgICAgICAgICAtIHByZWZpeF9saXN0X2lkcyAgPSBbXSUwQSAgICAgICAgICAgICAgLSBwcm90b2NvbCAgICAgICAgID0gXCJ0Y3BcIiUwQSAgICAgICAgICAgICAgLSBzZWN1cml0eV9ncm91cHMgID0gW10lMEEgICAgICAgICAgICAgIC0gc2VsZiAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgICAgICAgICAtIHRvX3BvcnQgICAgICAgICAgPSAzMzA2JTBBICAgICAgICAgICAgfSwlMEEgICAgICAgIF0gLT4gbnVsbCUwQSAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICA9IFwia2V5Y2xvYWNrLWRiLTIwMjQwMzAzMTY1NjI0Mzk3MzAwMDAwMDAyXCIgLT4gbnVsbCUwQSAgICAgIC0gbmFtZV9wcmVmaXggICAgICAgICAgICA9IFwia2V5Y2xvYWNrLWRiLVwiIC0+IG51bGwlMEEgICAgICAtIG93bmVyX2lkICAgICAgICAgICAgICAgPSBcIjQ5MzM3MDgyNjQyNFwiIC0+IG51bGwlMEEgICAgICAtIHJldm9rZV9ydWxlc19vbl9kZWxldGUgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiTmFtZVwiID0gXCJrZXljbG9hY2sgUkRTXCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcIk5hbWVcIiAgICAgICAgPSBcImtleWNsb2FjayBSRFNcIiUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAtIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgICAtIHZwY19pZCAgICAgICAgICAgICAgICAgPSBcInZwYy0wOGUxOWQ4NTljMjZkMThiMlwiIC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBhd3Nfc2VjdXJpdHlfZ3JvdXAua2V5Y2xvYWsgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3NlY3VyaXR5X2dyb3VwXCIgXCJrZXljbG9ha1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJrZXljbG9hayBSRFMgaW5zdGFuY2VcIiUwQSAgICAgICsgZWdyZXNzICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImtleWNsb2FrLWRiLVwiJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmV2b2tlX3J1bGVzX29uX2RlbGV0ZSA9IGZhbHNlJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJrZXljbG9hayBSRFNcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcImtleWNsb2FrIFJEU1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSBcInZwYy0wOGUxOWQ4NTljMjZkMThiMlwiJTBBICAgIH0lMEElMEEgICMgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5rZXljbG9hY2tfb3V0Z29pbmcgd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5rZXljbG9hY2tfb3V0Z29pbmcgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWNrX291dGdvaW5nXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czplYzI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWN1cml0eS1ncm91cC1ydWxlL3Nnci0wNTM1MTVlZDM5Njg5YzllZlwiIC0+IG51bGwlMEEgICAgICAtIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgPSBcInNnci0wNTM1MTVlZDM5Njg5YzllZlwiIC0+IG51bGwlMEEgICAgICAtIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcIi0xXCIgLT4gbnVsbCUwQSAgICAgIC0gc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IFwic2ctMDgxMDViNDg3YjQ1NmNhZDlcIiAtPiBudWxsJTBBICAgICAgLSBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gXCJzZ3ItMDUzNTE1ZWQzOTY4OWM5ZWZcIiAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiTmFtZVwiID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcIk5hbWVcIiAgICAgICAgPSBcIm91dGdvaW5nIHRyYWZmaWNcIiUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAtIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmtleWNsb2FrX291dGdvaW5nIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGVcIiBcImtleWNsb2FrX291dGdvaW5nXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiLTFcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2Fjay1pY21wIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2Fjay1pY21wIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJrZXljbG9hY2staWNtcFwiIHslMEEgICAgICAtIGFybiAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWMyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjdXJpdHktZ3JvdXAtcnVsZS9zZ3ItMDQwYWEyNWIyMzAyZmM5ODNcIiAtPiBudWxsJTBBICAgICAgLSBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIiAtPiBudWxsJTBBICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBhbGwgSUNNUCB0cmFmZmljXCIgLT4gbnVsbCUwQSAgICAgIC0gZnJvbV9wb3J0ICAgICAgICAgICAgICA9IC0xIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgPSBcInNnci0wNDBhYTI1YjIzMDJmYzk4M1wiIC0+IG51bGwlMEEgICAgICAtIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcImljbXBcIiAtPiBudWxsJTBBICAgICAgLSBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gXCJzZy0wODEwNWI0ODdiNDU2Y2FkOVwiIC0+IG51bGwlMEEgICAgICAtIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSBcInNnci0wNDBhYTI1YjIzMDJmYzk4M1wiIC0+IG51bGwlMEEgICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJOYW1lXCIgPSBcIklDTVAgdHJhZmZpY1wiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgICAtIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJOYW1lXCIgICAgICAgID0gXCJJQ01QIHRyYWZmaWNcIiUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAtIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgICAtIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAtMSAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUua2V5Y2xvYWNrLW15c3FsIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2Fjay1teXNxbCBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwia2V5Y2xvYWNrLW15c3FsXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czplYzI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWN1cml0eS1ncm91cC1ydWxlL3Nnci0wYzAwN2FhNjI5ZDA1N2Q1YVwiIC0+IG51bGwlMEEgICAgICAtIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjEwLjAuMC4wLzIyXCIgLT4gbnVsbCUwQSAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgbXlzcWwgdHJhZmZpY1wiIC0+IG51bGwlMEEgICAgICAtIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAzMzA2IC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgPSBcInNnci0wYzAwN2FhNjI5ZDA1N2Q1YVwiIC0+IG51bGwlMEEgICAgICAtIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcInRjcFwiIC0+IG51bGwlMEEgICAgICAtIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSBcInNnLTA4MTA1YjQ4N2I0NTZjYWQ5XCIgLT4gbnVsbCUwQSAgICAgIC0gc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IFwic2dyLTBjMDA3YWE2MjlkMDU3ZDVhXCIgLT4gbnVsbCUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcIk5hbWVcIiA9IFwibXlzcWwgYWNjZXNzXCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcIk5hbWVcIiAgICAgICAgPSBcIm15c3FsIGFjY2Vzc1wiJTBBICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgIC0gXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0gLT4gbnVsbCUwQSAgICAgIC0gdG9fcG9ydCAgICAgICAgICAgICAgICA9IDMzMDYgLT4gbnVsbCUwQSAgICB9JTBBJTBBICAjIGF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2FrLWljbXAgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImtleWNsb2FrLWljbXBcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCIlMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIkFsbG93IGFsbCBJQ01QIHRyYWZmaWNcIiUwQSAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IC0xJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiaWNtcFwiJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcIklDTVAgdHJhZmZpY1wiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiSUNNUCB0cmFmZmljXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdG9fcG9ydCAgICAgICAgICAgICAgICA9IC0xJTBBICAgIH0lMEElMEEgICMgYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUua2V5Y2xvYWstbXlzcWwgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImtleWNsb2FrLW15c3FsXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjEwLjAuMC4wLzIyXCIlMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIkFsbG93IG15c3FsIHRyYWZmaWNcIiUwQSAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDMzMDYlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJ0Y3BcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJteXNxbCBhY2Nlc3NcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIm15c3FsIGFjY2Vzc1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAzMzA2JTBBICAgIH0lMEElMEEgICMgcmFuZG9tX3Bhc3N3b3JkLmtleWNsb2Fja19zZXJ2aWNlIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIHJhbmRvbV9wYXNzd29yZC5rZXljbG9hY2tfc2VydmljZSBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJyYW5kb21fcGFzc3dvcmRcIiBcImtleWNsb2Fja19zZXJ2aWNlXCIgeyUwQSAgICAgIC0gYmNyeXB0X2hhc2ggPSAoc2Vuc2l0aXZlIHZhbHVlKSAtPiBudWxsJTBBICAgICAgLSBpZCAgICAgICAgICA9IFwibm9uZVwiIC0+IG51bGwlMEEgICAgICAtIGxlbmd0aCAgICAgID0gMjEgLT4gbnVsbCUwQSAgICAgIC0gbG93ZXIgICAgICAgPSB0cnVlIC0+IG51bGwlMEEgICAgICAtIG1pbl9sb3dlciAgID0gMCAtPiBudWxsJTBBICAgICAgLSBtaW5fbnVtZXJpYyA9IDAgLT4gbnVsbCUwQSAgICAgIC0gbWluX3NwZWNpYWwgPSAwIC0+IG51bGwlMEEgICAgICAtIG1pbl91cHBlciAgID0gMCAtPiBudWxsJTBBICAgICAgLSBudW1iZXIgICAgICA9IHRydWUgLT4gbnVsbCUwQSAgICAgIC0gbnVtZXJpYyAgICAgPSB0cnVlIC0+IG51bGwlMEEgICAgICAtIHJlc3VsdCAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSkgLT4gbnVsbCUwQSAgICAgIC0gc3BlY2lhbCAgICAgPSB0cnVlIC0+IG51bGwlMEEgICAgICAtIHVwcGVyICAgICAgID0gdHJ1ZSAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgcmFuZG9tX3Bhc3N3b3JkLmtleWNsb2FrX3NlcnZpY2Ugd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwicmFuZG9tX3Bhc3N3b3JkXCIgXCJrZXljbG9ha19zZXJ2aWNlXCIgeyUwQSAgICAgICsgYmNyeXB0X2hhc2ggPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsZW5ndGggICAgICA9IDIxJTBBICAgICAgKyBsb3dlciAgICAgICA9IHRydWUlMEEgICAgICArIG1pbl9sb3dlciAgID0gMCUwQSAgICAgICsgbWluX251bWVyaWMgPSAwJTBBICAgICAgKyBtaW5fc3BlY2lhbCA9IDAlMEEgICAgICArIG1pbl91cHBlciAgID0gMCUwQSAgICAgICsgbnVtYmVyICAgICAgPSB0cnVlJTBBICAgICAgKyBudW1lcmljICAgICA9IHRydWUlMEEgICAgICArIHJlc3VsdCAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICArIHNwZWNpYWwgICAgID0gdHJ1ZSUwQSAgICAgICsgdXBwZXIgICAgICAgPSB0cnVlJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmtleWNsb2FrLmF3c19lY3Nfc2VydmljZS5lY3Mgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2Vjc19zZXJ2aWNlXCIgXCJlY3NcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlcnZpY2UvYXV0aC9hdXRoXCIlMEEgICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImF1dGhcIiUwQSAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9JTBBICAgICAgfiB0YXNrX2RlZmluaXRpb24gICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhc2stZGVmaW5pdGlvbi9hdXRoOjdcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICgxMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICg0IHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5rZXljbG9hay5hd3NfZWNzX3Rhc2tfZGVmaW5pdGlvbi5lY3MgbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcImF3c19lY3NfdGFza19kZWZpbml0aW9uXCIgXCJlY3NcIiB7JTBBICAgICAgfiBhcm4gICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFzay1kZWZpbml0aW9uL2F1dGg6N1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGFybl93aXRob3V0X3JldmlzaW9uICAgICA9IFwiYXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXNrLWRlZmluaXRpb24vYXV0aFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGNvbnRhaW5lcl9kZWZpbml0aW9ucyAgICA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgICAgPSBcImF1dGhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuZXR3b3JrX21vZGUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSByZXF1aXJlc19jb21wYXRpYmlsaXRpZXMgPSBbXSAtPiBudWxsJTBBICAgICAgfiByZXZpc2lvbiAgICAgICAgICAgICAgICAgPSA3IC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICAgICMgKDUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSAgICB9JTBBJTBBUGxhbjogMTAgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMTAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMCIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDEwLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAxMH19```
</p></details>